{
  "exercises": [
    {
      "name": "Cable Neck Flexion",
      "textDescription": "Sit on bench facing away from middle pulley. Place neck in harness cable attachment. Place arms on lower thighs for support. Move head away from pulley by bending neck forward until chin touches upper chest. Return head by hyperextending neck and repeat."
    },
    {
      "name": "Cable Neck Rotation (with belt)",
      "textDescription": "Place workout chair or bench with vertical back support facing to one side near adjustable height cable pulley. Adjust pulley approximately height of head when seated. Attach belt on low pulley cable by attaching carabiner on belt buckle. Sit on bench, grasp attached belt from side. Face toward cable pulley and place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close forehead. Position torso upright with feet wide apart and hand nearest cable pulley on lower thigh for added support. Turn head away from pulley cable by rotating head away from pulley. Turn head back toward cable pulley and repeat. Turn seat the opposite direction or attach belt to pulley on opposite side and continue with other side."
    },
    {
      "name": "Cable Lateral Neck Rotation (with belt)",
      "textDescription": "Place workout chair or bench with vertical back support facing to one side near adjustable height cable pulley. Adjust pulley approximately height of head when seated. Attach belt on low pulley cable by attaching carabiner on belt buckle. Sit on bench, grasp attached belt from side. Face toward cable pulley and place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close forehead. Position torso upright with feet wide apart and hand nearest cable pulley on lower thigh for added support. Turn head away from pulley cable by rotating head away from pulley. Turn head back toward cable pulley and repeat. Turn seat the opposite direction or attach belt to pulley on opposite side and continue with other side."
    },
    {
      "name": "Machine Neck Flexion ",
      "textDescription": "Adjust pulley approximately height of neck or head when seated. Attach belt on low pulley cable by attaching carabiner on belt buckle. Sit on bench with pulley to one side and feet apart. Place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close to side of head. Pull torso upright by bracing opposite hand on far side of bench. Pull head away from pulley cable by laterally flexing neck. Tilt head back toward cable pulley and repeat. Sit on bench the opposite direction and continue with other side."
    },
    {
      "name": "Machine Lateral Neck Flexion",
      "textDescription": "Adjust pulley approximately height of neck or head when seated. Attach belt on low pulley cable by attaching carabiner on belt buckle. Sit on bench with pulley to one side and feet apart. Place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close to side of head. Pull torso upright by bracing opposite hand on far side of bench. Pull head away from pulley cable by laterally flexing neck. Tilt head back toward cable pulley and repeat. Sit on bench the opposite direction and continue with other side."
    },
    {
      "name": "Weighted Lying Neck Flexion",
      "textDescription": "Place folded towel on weight plate(s). Lie supine on bench, head extending off of end of bench. Place plates on forehead with towel placed in between for comfort. Move head up by flexing neck until chin touches upper chest. Return by hyperextending neck and repeat."
    },
    {
      "name": "Weighted Neck Flexion",
      "textDescription": "Place folded towel on weight plate. Lie supine perpendicular on bench with low back and hips extending off and feet on floor. Place weight and towel on forehead. Place plates on forehead with towel placed in between for comfort. Move head up by flexing neck until chin touches upper chest. Return by hyperextending neck and repeat."
    },
    {
      "name": "Weighted Lateral Neck Flexion",
      "textDescription": "Place folded towel on weight plate. Lie on bench on side with knees and hips bent and arm hanging over edge. Position weight and towel on side of upper head. Hold weight on side of head with hand of upper arm. Place hand of lower arm on floor for support. Move head up to side by laterally flexing neck. Lower head to opposite side and repeat. Lie on other side and continue."
    },
    {
      "name": "Cable Neck Extension (with belt)",
      "textDescription": "Sit on bench facing low pulley. Attach belt on low pulley cable by attaching carabiner on belt buckle. Place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close to forehead. Place other hand or forearm on lower thighs for support. Pull head up and back by hyperextending neck. Return by bending neck forward until chin touches upper chest. Repeat."
    },
    {
      "name": "Machine Neck Extension",
      "textDescription": "Sit on bench facing low pulley. Attach belt on low pulley cable by attaching carabiner on belt buckle. Place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close to forehead. Place other hand or forearm on lower thighs for support. Pull head up and back by hyperextending neck. Return by bending neck forward until chin touches upper chest. Repeat."
    },
    {
      "name": "Weighted Lying Neck Extension",
      "textDescription": "Lie prone on bench with head extended off of end and folded towel and weight plate(s) on floor. With both hands, place plate(s) on back of head with towel placed in between for comfort. Move head up by hyperextending neck up as high as possible. Return by bending neck down until chin touches upper chest. Repeat."
    },
    {
      "name": "Weighted Neck Extension",
      "textDescription": "Place folded towel on weight plate. On bench or stool, sit bent over on thighs. With both hands, place plate(s) on back of head with towel placed in between for comfort. Move head up by hyperextending neck up as high as possible. Return by bending neck down until chin touches upper chest. Repeat."
    },
    {
      "name": "Weighted Seated Neck Extension",
      "textDescription": "Place folded towel on weight plate. On bench or stool, sit bent over on thighs. With both hands, place plate(s) on back of head with towel placed in between for comfort. Move head up by hyperextending neck up as high as possible. Return by bending neck down until chin touches upper chest. Repeat."
    },
    {
      "name": "Front Neck Bridge",
      "textDescription": "Kneel on all fours on well cushioned mat. Place head on mat between hands. Rise and straighten knees. Fold hands behind low back or hips. Roll back onto forehead until nose touches mat. Roll forward onto top of head until chin touches upper chest. Repeat."
    },
    {
      "name": "Wall Front Neck Bridge",
      "textDescription": "Place small or folded cushioned mat on wall or column approximately chest height. With hands supporting mat on each side stand back so feet are away from wall or column with body leaning forward. Place top of forehead on mat. Fold hands behind low back or hips. Roll down onto forehead until nose touches mat. Roll up onto top of head until chin touches upper chest. Repeat."
    },
    {
      "name": "Wall Side Neck Bridge",
      "textDescription": "Place small or folded cushioned mat on column or at end of wall approximately shoulder height. With hands supporting mat, stand with side toward mat. Step far to side so feet are away from wall or column forward. Place side of head on mat with shoulder extending over end of adjacent side of column or wall so body leans to side. Fold hands behind low back or hips. Push side of head into mat and roll onto top of head moving body away from mat. Return to original position by rolling back down to side of head while bringing shoulder back over end of column or wall. Repeat."
    },
    {
      "name": "Neck Retraction Stretch",
      "textDescription": "Stand or sit. Pull head back as far possible while looking slightly down and hold stretch."
    },
    {
      "name": "Neck Rotation Stretch",
      "textDescription": "Stand or sit. Turn head over shoulder to one side. Hold stretch. Repeat to other side."
    },
    {
      "name": "Suspended Neck Flexion",
      "textDescription": "Place belt or strap around end of suspension trainer. Hold belt in hand and stand away from suspension trainer so it hangs to one side. Place belt around head above ears and clamp belt snugly around head by tightly gripping ends close to head above ear closest to suspension trainer. Step further away from suspension trainer until it is taut. Lean away at angle against support of belt and suspension trainer by positioning feet closer to side of suspension trainer while keeping head and body straight. Lower angle of body by tilting head to side of suspension trainer. Increase angle of body by tilting head away from side of suspension trainer. Repeat and continue in opposite position."
    },
    {
      "name": "Suspended Lateral Neck Flexion",
      "textDescription": "Place belt or strap around end of suspension trainer. Hold belt in hand and stand away from suspension trainer so it hangs to one side. Place belt around head above ears and clamp belt snugly around head by tightly gripping ends close to head above ear closest to suspension trainer. Step further away from suspension trainer until it is taut. Lean away at angle against support of belt and suspension trainer by positioning feet closer to side of suspension trainer while keeping head and body straight. Lower angle of body by tilting head to side of suspension trainer. Increase angle of body by tilting head away from side of suspension trainer. Repeat and continue in opposite position."
    },
    {
      "name": "Band Resistive Neck Retraction",
      "textDescription": "PreparationStand with back of neck against exercise band strapped accross rack. Position both arms behind bands to each side. Hold horizontal bar above if within reach."
    },
    {
      "name": "Rear Neck Bridge",
      "textDescription": "Lying supine on well cushioned mat. Position feet very close to hips. Raise buttocks and low back slightly off of floor and fold hands on abdomen. Extend hips and knees while pushing head back into floor. Roll back on head while arching spine high off of floor. Hyperextend neck back in attempt to bring forehead toward mat. Return body to close to mat until back of head and shoulders make contact with mat. Repeat."
    },
    {
      "name": "Wall Rear Neck Bridge",
      "textDescription": "Preparation Execution"
    },
    {
      "name": "Lying Neck Retraction",
      "textDescription": "InstructionsPreparationLie supine on mat. This exercise may be prescribed for functional forward head posture since it strengthens Splenius without neck flexion. The stretch that occurs during complete neck flexion, may exacerbate forward head posture, particularly if neck flexion is held under load. Neck flexion normally occurs at end of eccentric portion of dynamic Splenius exercises."
    },
    {
      "name": "Neck Extensor Stretch",
      "textDescription": "Bow head forward with jaw shut. Depress chin into top of sternum. Slightly turn head to one side. Hold stretch. Repeat to other side."
    },
    {
      "name": "Suspended Neck Extension",
      "textDescription": "Preparation Execution"
    },
    {
      "name": "Barbell Behind Neck Press",
      "textDescription": "Grasp barbell with overhand grip from rack or clean from floor. Position bar behind neck. Press bar upward until arms are extended overhead. Return behind neck and repeat."
    },
    {
      "name": "Barbell Front Raise",
      "textDescription": "Grasp barbell with overhand grip with elbows straight or slightly bent. Raise barbell forward and upward until upper arms are above horizontal. Lower and repeat."
    },
    {
      "name": "Incline Barbell Front Raise",
      "textDescription": "Grasp barbell with shoulder width overhand grip. Lie supine on upper portion of 45 degree incline bench with legs straight. Position barbell on top of upper thighs. With elbows straight or slightly bent, raise barbell up and over shoulders until uppers arm are vertical. Lower barbell to upper thigh and repeat."
    },
    {
      "name": "Barbell Military Press",
      "textDescription": "Grasp barbell from rack or clean barbell from floor with overhand grip, slightly wider than shoulder width. Position bar in front of neck. Press bar upward until arms are extended overhead. Lower to front of neck and repeat."
    },
    {
      "name": "Seated Barbell Military Press",
      "textDescription": "Grasp barbell with slightly wider than shoulder width overhand grip from rack. Position bar near upper chest. Press bar upward until arms are extended overhead. Return to upper chest and repeat."
    },
    {
      "name": "Barbell Shoulder Press",
      "textDescription": "Grasp barbell with slightly wider than shoulder width overhand grip from rack. Position bar near upper chest. Press bar upward until arms are extended overhead. Return to upper chest and repeat."
    },
    {
      "name": "Reclined Barbell Shoulder Press",
      "textDescription": "Sit on Incline bench angled at 70° to 80°. Grasp barbell with slightly wider than shoulder width overhand grip from rack. Lean back on reclined back pad with bar positioned near upper chest. Press bar upward until arms are extended overhead. Return to upper chest and repeat."
    },
    {
      "name": "Cable Bar Behind Neck Press",
      "textDescription": "Stand facing cable bar, mounted on each side to upper waist height narrow double pulley cables. Grasp cable bar with wide overhand grip upper chest height. Stand directly between both cable pulleys with one foot forward and other foot back. Push cable bar over head and position cable bar behind neck or rest on shoulders. Press cable bar upward until arms are extended overhead. Return behind neck and repeat."
    },
    {
      "name": "Cable Bar Front Raise",
      "textDescription": "Grasp cable bar with overhand grip with elbows straight or slightly bent. Raise cable bar forward and upward until upper arms are above horizontal. Lower and repeat."
    },
    {
      "name": "Cable Bar Military Press",
      "textDescription": "Stand facing cable bar, mounted on each side to upper waist height narrow double pulley cables. Grasp cable bar with overhand grip, slightly wider than shoulder width. Position cable bar upper chest height. Stand directly between both cable pulleys with one foot forward and other foot back. Press cable bar upward until arms are extended overhead. Return to upper chest and repeat."
    },
    {
      "name": "Cable Bar Shoulder Press",
      "textDescription": "Stand facing cable bar mounted on each side to upper waist height narrow double pulley cables. Grasp cable bar with wide overhand grip and position upper chest height. Stand directly between both cable pulleys with one foot forward and other foot back. Press cable bar upward until arms are extended overhead. Return to upper chest and repeat."
    },
    {
      "name": "Cable Front Raise",
      "textDescription": "Sit on seat above twin cable pulleys. Grasp stirrups on each side. Sit upright with arms straight down to each side with palms facing back. Raise stirrups forward and upward until upper arms are well above horizontal. Lower and repeat."
    },
    {
      "name": "Cable Alternating Front Raise",
      "textDescription": "Stand with low double pulleys behind. Grasp stirrup attachments, one in each hand. Stand away from pulley slightly with arms back somewhat at side and elbows straight or slightly bent. Raise one stirrup forward and upward until upper arm is well above horizontal. Lower and repeat with opposite arm, alternating between arms."
    },
    {
      "name": "Seated Cable Alternating Front Raise",
      "textDescription": "Sit on seat above twin cable pulleys. Grasp stirrups on each side. Sit upright with arms straight down to each side with palms facing back. Raise one stirrup forward and upward until upper arm is well above horizontal. Lower and repeat with opposite arm. Continue by alternating raises between sides."
    },
    {
      "name": "Cable One Arm Front Raise",
      "textDescription": "Grasp stirrup attachment. Stand away from pulley slightly with arm back somewhat at side and elbow straight or slightly bent. Raise stirrup forward and upward until upper arm is well above horizontal. Lower and repeat. Repeat with opposite arm."
    },
    {
      "name": "Cable One Arm Front Raise with Rope",
      "textDescription": "Grasp end of Triceps Rope Cable attachment with one hand so that protruding end is in contact with side of hand (thumb and index finger). Stand away from pulley with arm back at side and elbow straight. Raise stirrup forward and upward until arm is well above horizontal or cable makes contact with underside of upper arm. Lower and repeat. Repeat with opposite arm."
    },
    {
      "name": "Cable Shoulder Press",
      "textDescription": "Stand between two low to medium height pulleys. Grasp cable stirrups from each side. Position stirrups to each side of shoulders with elbows down to sides and stirrups above or slightly narrower than elbows. Push stirrups upward until arms are extended overhead. Return stirrups to sides of shoulders and repeat."
    },
    {
      "name": "Seated Cable Shoulder Press",
      "textDescription": "Sit on seat and grasp stirrups from low to medium low position from each side. Position stirrups to each side of shoulders with elbows down to sides and stirrups above or slightly narrower than elbows. Push stirrups upward until arms are extended overhead. Return stirrups to sides of shoulders and repeat."
    },
    {
      "name": "Cable Twisting Overhead Press",
      "textDescription": "Stand beside low to medium height pulley. Grasp cable stirrup. Position stirrup to front of shoulder with elbow down to side. Place opposite hand on hip. With feet wide apart, squat down slightly. Rotate body away from pulley and straighten legs while pushing stirrup diagonally upward toward opposite side of body. Return to original position and repeat."
    },
    {
      "name": "Dumbbell Arnold Press",
      "textDescription": "Stand with two dumbbells position in front of shoulders, palms facing body and elbows under wrists. Initiate movement by bringing elbows out to sides. Continue to raise elbows outward while pressing dumbbells overhead until arms are straight. Lower to front of shoulders in opposite pattern and repeat."
    },
    {
      "name": "Dumbbell Front Raise",
      "textDescription": "Grasp dumbbells in both hands. Position dumbbells in front of upper legs with elbows straight or slightly bent. Raise dumbbells forward and upward until upper arms are above horizontal. Lower and repeat."
    },
    {
      "name": "Dumbbell Alternating Front Raise",
      "textDescription": "Grasp dumbbells in both hands. Position dumbbells in front of upper legs with elbows straight or slightly bent. Raise one dumbbell forward and upward with palms positioned downward until upper arm is above horizontal. Lower and repeat with opposite arm, alternating between arms."
    },
    {
      "name": "Incline Dumbbell Alternating Front Raise",
      "textDescription": "Grasp dumbbells and lie supine on upper portion of 45 degree incline bench with legs straight. Position dumbbells downward below each shoulder. With elbows straight or slightly bent, raise one dumbbell forward, up and over shoulder until upper arm is vertical. Lower dumbbell down to starting position. Repeat raise with other arm, alternating between sides."
    },
    {
      "name": "Seated Dumbbell Alternating Front Raise",
      "textDescription": "Sit on end of bench with dumbbell in each hand and legs together. Position dumbbells with palms facing inward and arms hanging down straight. Raise one dumbbell forward and upward while turning palms downward as soon as dumbbell clears thigh. Continue raising dumbbell until upper arm is above horizontal. Lower and turn palms inward while dumbbells travels past thigh until arm is in original vertical position. Repeat with opposite arm, alternating movement pattern between arms."
    },
    {
      "name": "Seated Dumbbell Front Raise",
      "textDescription": "Sit on end of bench with dumbbell in each hand and legs together. Position dumbbells with palms facing inward and arms hanging down slightly bent. Raise upper arms to sides until slightly bent elbows are shoulder height while maintaining elbows' height above or equal to wrists. Lower and repeat."
    },
    {
      "name": "Dumbbell Shoulder Press",
      "textDescription": "Position dumbbells to each side of shoulders with elbows below wrists. Press dumbbells upward until arms are extended overhead. Lower to sides of shoulders and repeat."
    },
    {
      "name": "Dumbbell One Arm Shoulder Press",
      "textDescription": "Stand with dumbbells positioned near shoulder with elbow below wrists. Press dumbbell upward until arm is extended overhead. Lower to side of shoulder and repeat."
    },
    {
      "name": "Reclined Dumbbell Shoulder Press",
      "textDescription": "Position dumbbells to each side of shoulders with elbows below wrists. Lean back on back pad angled 70 to 80 degrees. Press dumbbells upward until arms are extended overhead. Lower to sides of upper chest and repeat."
    },
    {
      "name": "Machine Behind Neck Press",
      "textDescription": "Sit on bench with bar positioned behind shoulders. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Press bar upward until arms are extended overhead. Lower bar behind neck and repeat."
    },
    {
      "name": "Machine Barbell Behind Neck Press",
      "textDescription": "Sit on bench with bar positioned behind shoulders, also facing away from fulcrum. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Press bar upward until arms are extended overhead. Lower bar behind neck and repeat."
    },
    {
      "name": "Machine Military Press",
      "textDescription": "Sit on bench with bar positioned in front of shoulders. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Press bar upward until arms are extended overhead. Lower bar to front of shoulders and repeat."
    },
    {
      "name": "Reclined Machine Shoulder Press",
      "textDescription": "Sit on Incline bench angled at 70° to 80°. Grasp barbell with slightly wider than shoulder width overhand grip from rack. Lean back on reclined back pad with bar positioned near upper chest. Press bar upward until arms are extended overhead. Return to upper chest and repeat."
    },
    {
      "name": "Machine Shoulder Press",
      "textDescription": "Sit on bench with bar positioned in front of shoulders. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Press bar upward until arms are extended overhead. Lower bar to front of shoulders and repeat."
    },
    {
      "name": "Machine Barbell Machine Shoulder Press",
      "textDescription": "Sit on bench with bar positioned in front of shoulders. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Press bar upward until arms are extended overhead. Lower bar to front of shoulders and repeat."
    },
    {
      "name": "Machine One Arm Shoulder Press",
      "textDescription": "Position dumbbells to each side of shoulders with elbows below wrists. Press dumbbells upward until arms are extended overhead. Lower to sides of shoulders and repeat."
    },
    {
      "name": "Sled Machine Shoulder Press",
      "textDescription": "Lie supine on back pad with shoulders under shoulder pad. Place feet on platform slightly higher than base of sled. Extend hips and knees. Release dock levers. To lower sled, bend hips and knees until knees are just short of complete flexion. Raise sled by extending knees and hips. Repeat."
    },
    {
      "name": "Smith Machine Behind Neck Press",
      "textDescription": "Sit on bench with bar positioned behind shoulders. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Press bar upward until arms are extended overhead. Lower bar behind neck and repeat."
    },
    {
      "name": "Smith Machine Shoulder Press",
      "textDescription": "Sit on bench with bar positioned in front of shoulders. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Press bar upward until arms are extended overhead. Lower bar to front of shoulders and repeat."
    },
    {
      "name": "Barbell Upright Row",
      "textDescription": "Grasp bar with shoulder width or slightly narrower overhand grip. Pull bar to neck with elbows leading. Allow wrists to flex as bar rises. Lower and repeat."
    },
    {
      "name": "Cable Lateral Raise",
      "textDescription": "With low pulleys to each side, grasp left stirrup with right hand and right stirrup with left hand. Stand upright. With elbows slightly bent, raise arms to sides until elbows are shoulder height. Lower and repeat."
    },
    {
      "name": "Cable One Arm Lateral Raise",
      "textDescription": "Grasp stirrup cable attachment. Stand facing with side of resting arm toward low pulley. Grasp ballet bar if available. With elbow slightly bent, raise arm to side away from low pulley until elbow is shoulder height. Lower and repeat."
    },
    {
      "name": "Cable Lateral Raise with Close Pulleys",
      "textDescription": "Stand facing two low pulleys positioned side by side. Grasp stirrups with each hand. Stand upright with arms staight down to each side. With elbows slightly bent, raise arms to side until elbows are shoulder height. Lower and repeat."
    },
    {
      "name": "Seated Cable Lateral Raise",
      "textDescription": "Sit at edge of bench with feet of floor ahead of knees. Rest torso on thighs. Reach under legs and grasp stirrup cable attachments, right hand holding left stirrup, left hand holding right stirrup. Pull stirrups out to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10° to 30° angle) throughout exercise. Lower until arms contact sides of legs. Repeat."
    },
    {
      "name": "Cable Upright Row",
      "textDescription": "Grasp each side of rope with overhand grip, just under rope ends. Stand close to pulley. Pull rope ends to front of shoulders with elbows leading. Allow wrists to flex as stirrups are lifted. Lower and repeat."
    },
    {
      "name": "Cable Bar Upright Row",
      "textDescription": "Grasp cable bar with shoulder width or slightly narrower overhand grip. Stand close to cable bar. Pull bar to neck with elbows leading. Allow wrists to flex as bar rises. Lower and repeat."
    },
    {
      "name": "Cable Dual Pulley Upright Row",
      "textDescription": "Stand between low dual pulleys. Grasp handles with opposite hands - right hand holds left stirrup and left hand holds right stirrup. Stand upright with arms straight and palms facing back (overhand grip), one stirrup in front of other. Pull handles up to front of shoulders with elbows leading and cables crossed. Allow wrists to flex as stirrups are lifted. Lower and repeat."
    },
    {
      "name": "Cable One Arm Upright Row",
      "textDescription": "Grasp stirrup on low pulley with overhand grip. Stand with side of arm with stirup away from pulley machine, arm against front of body. Place other hand on ballet bar or side of pulley column for support. Pull stirup to front side of shoulder with elbow leading. Allow wrist to flex as stirrup is lifted. Lower and repeat."
    },
    {
      "name": "Cable Y Raise",
      "textDescription": "Stand facing between low pulleys medium width apart, grasp left stirrup with right hand and right stirrup with left hand. Step back slightly away from pulleys and stand upright with cables crossed in front of hips. With elbows slightly bent, raise arms upward and outward to sides in Y configuration until elbows are approximately lateral to each ear. Lower stirrups forward and downward in reverse pattern. Repeat."
    },
    {
      "name": "Seated Cable Y Raise",
      "textDescription": "On dual pulley seated row machine, sit slightly forward on seat or bench in order to grasp both cable attachments. Place feet on vertical platform. Position torso upright and slide hips back so knees are slightly bent. Raise arms upward and outward to sides in Y configuration while allowing elbows to partially bend. Pull back until elbows are approximately lateral to each ear. Lower stirrups forward and downward until arms are extended straight in front of body. Repeat."
    },
    {
      "name": "Seated Cable Y Raise with Rope",
      "textDescription": "Sit slightly forward on seat or bench and grasp ends of rope attachment with hand. Place feet on vertical platform. Slide hips back so knees are slightly bent. With torso upright pull rope upward over head until elbows are approximately lateral to each ear. Lower stirrups forward and downward until arms are extended straight in front of body. Repeat."
    },
    {
      "name": "Incline Dumbbell Lateral Raise",
      "textDescription": "Grasp dumbbell in one hand. Lie on 30° to 45° incline bench with opposite side of body on incline, arm over top of bench, lower leg positioned on front side of seat, and upper leg on back side of seat. Position dumbbell inside of lower leg, just in front of upper leg. Raise dumbbell from until upper arm is perpendicular to torso. Maintain slight fixed bend in elbow throughout exercise. Lower dumbbell to front of upper leg and repeat."
    },
    {
      "name": "Dumbbell Lateral Raise",
      "textDescription": "Grasp dumbbells in front of thighs with elbows slightly bent. Bend over slightly with hips and knees bent slightly. Raise upper arms to sides until slightly bent elbows are shoulder height while maintaining elbows' height above or equal to wrists. Lower and repeat."
    },
    {
      "name": "Dumbbell One Arm Lateral Raise",
      "textDescription": "Position dumbbell in front of pelvis with elbow slightly bent. Grasp stationary object with other hand for support. Bend over with hips and knees bent slightly. Raise upper arm to side until slightly bent elbow is shoulder height while maintaining elbow's height above or equal to wrist. Lower and repeat."
    },
    {
      "name": "Seated Dumbbell One Arm Lateral Raise",
      "textDescription": "Sit on stool or end of bench with legs together. Position dumbbell to side with elbow slightly bent. Angle torso slightly forward and place free hand on end of thigh for support. Raise upper arm to side until slightly bent elbow is shoulder height while maintaining elbow's height above or equal to wrist. Lower and repeat."
    },
    {
      "name": "Seated Dumbbell Lateral Raise",
      "textDescription": "Sit on edge of bench with feet placed beyond knees. Bend over and rest torso on thighs. Grasp dumbbells with each hand under legs. Position elbows with slight bend with palms facing together behind ankles (as shown) or just to sides of ankles. Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10° to 30° angle) throughout exercise. Maintain elbows height above wrists by raising \"pinkie finger\" side up. Lower and repeat."
    },
    {
      "name": "Dumbbell Lying Lateral Raise",
      "textDescription": "Lie chest down on elevated bench. Grasp dumbbells below to each side. Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10° to 30° angle) throughout exercise. Maintain height of elbows above wrists by raising \"pinkie\" side up. Lower and repeat."
    },
    {
      "name": "Dumbbell Raise",
      "textDescription": "Stand and grasp dumbbells with arms to side, palms facing sides of thighs. Pull dumbbells up to sides of ribs with elbows out to sides. Lower and repeat."
    },
    {
      "name": "Dumbbell Upright Row",
      "textDescription": "Grasp dumbbells and stand with palms facing front of thighs. Pull dumbbells to front of shoulder with elbows leading out to sides. Allow wrists to flex as dumbbells rise upward. Lower and repeat."
    },
    {
      "name": "Dumbbell One Arm Upright Row",
      "textDescription": "Sit on end of bench with legs far apart. Grasp dumbbell between legs with arm vertical under shoulder. Position torso slightly forward with hand on knee for support. Pull dumbbell to front of shoulder with elbow leading out to side. Allow wrists to flex as dumbbell rises upward. Lower and repeat."
    },
    {
      "name": "Seated Dumbbell Upright Row",
      "textDescription": "Sit on end of bench with legs far apart. Grasp dumbbell between legs with arm vertical under shoulder. Position torso slightly forward with hand on knee for support. Pull dumbbell to front of shoulder with elbow leading out to side. Allow wrists to flex as dumbbell rises upward. Lower and repeat."
    },
    {
      "name": "Barbell Machine Upright Row",
      "textDescription": "Stand behind bar mid-thigh height, facing away from from fulcrum. Grasp bar with shoulder width or slightly narrower overhand grip. Disengage bar by rotating bar back and stand upright. Pull bar to neck with elbows leading. Allow wrists to flex as bar rises. Lower and repeat."
    },
    {
      "name": "Machine Lateral Raise",
      "textDescription": "Sit in machine. Situate bent arms between padded lever and sides of body. Grasp handles if available. Raise arms to sides until upper arms are horizontal. Return and repeat."
    },
    {
      "name": "Smith Machine Upright Row",
      "textDescription": "Stand behind bar mid-thigh height. Grasp bar with shoulder width or slightly narrower overhand grip. Disengage bar by rotating bar back and stand upright. Pull bar to neck with elbows leading. Allow wrists to flex as bar rises. Lower and repeat."
    },
    {
      "name": "Barbell Rear Delt Raise",
      "textDescription": "Stand holding barbell behind thighs or hips with arms straight down to sides. Pull barbell behind hips and low back up as far as possible allowing elbows to travel up behind body to each side. Flex wrists near top of movement so bar can be raised higher. Lower until arms and wrists are straight. Repeat."
    },
    {
      "name": "Barbell Rear Delt Row",
      "textDescription": "Bend knees slightly and bend over bar with back straight, approximately horizontal. Grasp bar with wide overhand grip. Keeping upper arm perpendicular to torso, pull barbell up toward upper chest until upper arms are just beyond horizontal. Return and repeat."
    },
    {
      "name": "Barbell Lying Rear Delt Row",
      "textDescription": "Lie chest down on elevated bench. Grasp bar with wide overhand grip. Keeping upper arm perpendicular to torso, pull barbell up toward upper chest until upper arms are just beyond parallel to floor. Return and repeat."
    },
    {
      "name": "Cable Reverse Fly",
      "textDescription": "Stand facing twin pulley cables positioned close together and approximately shoulder height. Grasp stirrup cable attachment in each hand. Step back away from machine so cable is taut. Stand with feet staggered. Point elbows outward with arms straight or slightly bent. Pull stirrups out to sides, maintaining stiff elbow position throughout exercise. Return to original position and repeat."
    },
    {
      "name": "Seated Cable Reverse Fly",
      "textDescription": "Sit on seat facing twin pulley cables positioned approximately shoulder height. Grasp stirrup cable attachment in each hand. Straighten lower back upright so cable is taut. Point elbows outward with arms slightly bent. Keeping elbows pointed high, pull stirrups out to sides, maintaining slightly bent elbow position throughout exercise. Return to original position and repeat."
    },
    {
      "name": "Cable One Arm Reverse Fly",
      "textDescription": "Stand with side to shoulder height cable pulley. Grasp stirrup cable attachment with hand furthest from pulley. Position arm across neck with elbow bent 30° to 45° outward. Keeping elbows pointed high, pull stirrup out to side, maintaining fixed elbow position throughout exercise. Return to original position and repeat. Repeat with other arm."
    },
    {
      "name": "Cable Supine Reverse Fly",
      "textDescription": "With bench between two high pulleys to each side, grasp left stirrup with right hand and right stirrup with left hand. Lie on bench with pulleys to each side of shoulders. Arms should be crossed above upper chest with elbows slightly bent. Pull upper arms down to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (just slightly bent) as arms are pulled down to sides. Return arms to original position and repeat."
    },
    {
      "name": "Cable Rear Delt Row",
      "textDescription": "Sit slightly forward on bench or platform in order to grasp cable bar attachment. With elbow width overhand grip, straighten torso upright and slide hips back until knees are only slightly bent. Pull cable attachment toward upper chest, just below neck, with elbows up out to sides until elbows travel slightly behind back. Keep upper arms horizontal, perpendicular to trunk. Return until arms are extended and shoulders are stretched forward. Repeat."
    },
    {
      "name": "Cable One Arm Rear Delt Row",
      "textDescription": "Sit slightly forward on bench or platform in order to grasp stirrup cable attachment with one hand. Straighten torso upright and slide hips back until knees are only slightly bent. Point elbow out to side. Pull stirrup out to side, elbows up shoulder height until elbows travel slightly behind back. Allow wrist to follow elbow. Keep upper arm horizontal, perpendicular to trunk. Return until arm is extended and shoulder is stretched forward. Repeat."
    },
    {
      "name": "Cable Rear Lateral Raise",
      "textDescription": "Stand with cable columns to each side. Grasp left stirrup with right hand and right stirrup with left hand. Bend knees and bend over at hips, so torso is approximately horizontal with back straight. Point elbows outward with arms slightly bent. Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and slight bend in elbows as arms are raised to sides. Lower and repeat."
    },
    {
      "name": "Cable One Arm Rear Lateral Raise",
      "textDescription": "Stand with side to low pulley. Grasp stirrup attachment with hand furthest from pulley. Bend knees slightly and bend over with resting arm to side of low pulley. Raise arm to side until elbow is shoulder height. Maintain upper arm perpendicular to torso and fixed elbow position (10° to 30° angle) throughout exercise. Lower and repeat. Repeat with other arm."
    },
    {
      "name": "Seated Cable Rear Lateral Raise",
      "textDescription": "Sit at edge of bench with feet of floor ahead of knees. Rest torso on thighs. Reach under legs and grasp stirrup cable attachments, right hand holding left stirrup, left hand holding right stirrup. Pull stirrups out to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10° to 30° angle) throughout exercise. Lower until arms contact sides of legs. Repeat."
    },
    {
      "name": "Standing Cable Cross Row",
      "textDescription": "Stand between two shoulder-high cable pulleys (adjustable cross-over machine). Grasp right stirrup with left hand and left stirrup with right hand. Step back until cables are angled back 30° to 45°. Position both elbows at height of shoulders, one over other. Pull both cable attachments by moving elbows back to sides. Keep upper arms horizontal, perpendicular to trunk. Return and repeat."
    },
    {
      "name": "Standing Cable One Arm Cross Row",
      "textDescription": "Facing shoulder height cable pulley, grasp stirrup cable attachment with one hand, palm orientated down. Step back and turn body inward about 30° to 45° to face extended arm about. Stand back just enough to allow arm to be fully extended with weight raised up slightly. Pull stirrup back with elbow up at shoulder height until elbow travels just behind shoulder. Keep upper arm horizontal, perpendicular to trunk. Return until arm is fully extended. Repeat."
    },
    {
      "name": "Dumbbell Lying Rear Delt Row",
      "textDescription": "Lie chest down on elevated bench. Grasp dumbbells below. Keeping upper arm perpendicular to torso and dumbbells just below elbows, pull dumbbells up until elbows are just above shoulders. Return and repeat."
    },
    {
      "name": "Dumbbell Lying Rear Lateral Raise",
      "textDescription": "Lie chest down on elevated bench. Grasp dumbbells below to each side. Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10° to 30° angle) throughout exercise. Maintain height of elbows above wrists by raising \"pinkie\" side up. Lower and repeat."
    },
    {
      "name": "Dumbbell Lying One Arm Rear Lateral Raise",
      "textDescription": "With dumbbell in one hand, lie chest down on elevated bench. Position palm forward (thumb up) with elbow straight or slightly bent. Raise upper arm to side until elbow is shoulder height. Maintain upper arms perpendicular to torso with elbow straight throughout exercise. Maintain palm forward position. Lower and repeat."
    },
    {
      "name": "Dumbbell Rear Lateral Raise",
      "textDescription": "Grasp dumbbells to each side. Bend knees and bend over through hips with back flat, close to horizontal. Position elbows with slight bend and palms facing together. Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10° to 30° angle) throughout exercise. Maintain height of elbows above wrists by raising \"pinkie finger\" side up. Lower and repeat."
    },
    {
      "name": "Dumbbell Rear Delt Row",
      "textDescription": "Kneel over side of bench with arm and leg to side. Grasp dumbbell. Pull dumbbell up out to side with upper arm perpendicular to trunk until upper arm is just beyond horizontal. Lower and repeat."
    },
    {
      "name": "Seated Dumbbell Rear Lateral Raise",
      "textDescription": "Sit on edge of bench with feet placed beyond knees. Bend over and rest torso on thighs. Grasp dumbbells with each hand under legs. Position elbows with slight bend with palms facing together behind ankles (as shown) or just to sides of ankles. Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10° to 30° angle) throughout exercise. Maintain elbows height above wrists by raising \"pinkie finger\" side up. Lower and repeat."
    },
    {
      "name": "Dumbbell Side Lying Rear Delt Raise",
      "textDescription": "Lie on side with legs separated for support. Grasp dumbbell in front of chest, palm facing down, arm extended forward with slight bend. Raise dumbbell from floor until it travels above shoulder. Return dumbbell to floor at original position. Repeat."
    },
    {
      "name": "Incline Machine Rear Delt Row",
      "textDescription": "On dual pulley seated row machine, sit slightly forward on seat or bench in order to grasp both cable attachments. Place feet on vertical platform. Position torso upright and slide hips back so knees are slightly bent. Raise arms upward and outward to sides in Y configuration while allowing elbows to partially bend. Pull back until elbows are approximately lateral to each ear. Lower stirrups forward and downward until arms are extended straight in front of body. Repeat."
    },
    {
      "name": "Machine Lying Rear Lateral Raise",
      "textDescription": "Lie on machine with chest against padding. Position arms between padded lever arms with elbows below shoulders. Pull arms up until elbows are beyond back. Lower and repeat."
    },
    {
      "name": "Machine Rear Delt Raise",
      "textDescription": "Stand on platform facing lateral raise machine. Bend knees and bend over at hips with back flat close to horizontal. With elbows bent under shoulders, position back of upper arms against arm pads. Maintaining torso position, raise upper arms to sides until elbows are shoulder height. Lower and repeat."
    },
    {
      "name": "Seated Machine Rear Delt Row",
      "textDescription": "Place seat at low position. Sit on seat with chest against pad and grasp upper handles. Pull lever with elbows up out to sides until upper arms are just beyond parallel, keeping upper arm horizontal, perpendicular to torso. Return and repeat."
    },
    {
      "name": "Seated Machine Rear Lateral Raise",
      "textDescription": "Sit on machine with chest against pad. Grasp parallel handles with thumbs up at shoulder height. Slightly bend elbows and internally rotate shoulders so elbows are also at height of shoulders. Keeping elbows pointed high, pull handles apart and to rear until elbows are just behind back. Return and repeat."
    },
    {
      "name": "T-Bar Rear Delt Row",
      "textDescription": "Straddle lever bar facing handles. Bend knees slightly and bend over handles with back straight. Grasp wide grip handles with overhand grip. With arms extended, position torso just high enough to allow weight to make contact with floor. With elbows out to sides, pull bar up toward upper chest until elbows are same height as shoulders or just beyond, keeping upper arm perpendicular to torso. Return and repeat."
    },
    {
      "name": "Seated Machine Reverse Fly",
      "textDescription": "Sit on machine with chest against pad. Grasp parallel handles with thumbs up at shoulder height. Slightly bend elbows and internally rotate shoulders so elbows are also at height of shoulders. Keeping elbows pointed high, pull handles apart and to rear until elbows are just behind back. Return and repeat."
    },
    {
      "name": "Smith Machine Rear Delt Row",
      "textDescription": "Stand near low smith bar. Bend knees and bend over bar with back straight. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Keeping upper arm perpendicular to torso, pull bar up toward upper chest until upper arms are just beyond parallel to floor. Return and repeat."
    },
    {
      "name": "Cable Front Lateral Raise",
      "textDescription": "Grasp dumbbell cable attachment. Stand facing side with resting arm toward low pulley. Grasp ballet bar if available for support. Internally rotate shoulders so elbows point out to sides. With elbow straight or slightly bent, raise upper arm away from low pulley to side, slightly to front (30°) until upper arm is shoulder height. Lower and repeat. Continue with opposite arm."
    },
    {
      "name": "Dumbbell Front Lateral Raise",
      "textDescription": "Grasp dumbbell and position in front of thigh with arm straight. Turn pinkie finger side outward. Raise arms to side, slightly to front until shoulder height or slightly higher. Lower and repeat. Continue with opposite arm."
    },
    {
      "name": "Seated Dumbbell Front Lateral Raise",
      "textDescription": "Sit on stool or end of bench with dumbbell. Position dumbbell down to side with arm straight. Turn pinkie finger side outward. Raise arms to side, slightly in front until shoulder height or slightly higher. Lower and repeat. Continue with opposite arm."
    },
    {
      "name": "Handstand Push-up",
      "textDescription": "Stand facing wall between two benches positioned side by side, slightly apart, and slightly away and perpendicular to wall. Place hands on ends of benches closest to wall. Place forefeet on bench and kick lower body up to handstand position with arms and legs straight. Maintain balance with lower body against wall. Lower head between ends of benches by bending arms. Push body back up to original position by extending arms. Repeat."
    },
    {
      "name": "Handstand Push-ip on parallettes",
      "textDescription": "Stand facing parallette bars. Squat down and grasp bars with elbows bent and tucked. Bend forward, position head low, and kick feet up with legs bent so torso is in forward angled inverted position. While maintaining balance extend legs over body with spine hyperextended. While maintaining body balanced over bars, push inverted body up by extending arms until straight. Lower body down by bending arms until shoulders are close to bars. Repeat."
    },
    {
      "name": "Pike Press",
      "textDescription": "Kneel on two benches positioned side by side slightly apart at end nearest head. Place hands on ends of benches. With forefeet on opposite ends of bench, raise rear end high up with arms, back, and knees straight. Adjust feet so they are somewhat close to hands while keeping back and legs straight. Lower head between ends of benches by bending arms. Push body back up to original position by extending arms. Repeat."
    },
    {
      "name": "Elevated Pike Press",
      "textDescription": "Stand between two incline benches positioned side by side slightly apart at end nearest head. Place hands on ends of benches and straighten arms. Position forefeet on opposite ends of bench. Raise rear end high up with arms, back, and knees straight. Lower head between ends of benches by bending arms. Push body back up to original position by extending arms. Repeat."
    },
    {
      "name": "Suspended Front Raise",
      "textDescription": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handles. Position body and legs straight at desired angle, hanging from handles with arms straight and palms facing downward. Raise arms upward overhead by flexing shoulders with arms straight. Return and lower body back until arms are extended straight forward in original position. Repeat."
    },
    {
      "name": "Doorway Stretch",
      "textDescription": "Stand at end of wall or in doorway facing perpendicular to wall. Position palm on surface of wall slightly lower than shoulder. Bend elbow slightly. Turn body away from positioned arm. Hold stretch. Repeat with opposite arm."
    },
    {
      "name": "Lying Front Deltoid Stretch",
      "textDescription": "Lie prone on mat and extend both arms out to sides. Position right arm slightly lower than shoulder. Also bend left knee. Roll body onto right side by pushing left hand onto floor. Positioning bent left leg over straight right leg until stretch is felt. Hold stretch. Repeat in opposite position."
    },
    {
      "name": "Seated Front Deltoid Stretch",
      "textDescription": "Instruct participant to sit on floor or bench and place arms to behind hips. From behind, grasp participant's wrists, positioning them wider than shoulder width. Continue to raise participant's arms upward behind their body, out to sides. Hold stretch."
    },
    {
      "name": "Wall Stretch",
      "textDescription": "Place both hands on wall with arms extended. Lean against wall with one leg bent forward and other leg extended back. Bend rear knee slightly, positioned foot directly forward, and place heal to floor. Lower knee until just before heel raises. Hold stretch for 20 seconds. Repeat with opposite leg."
    },
    {
      "name": "Assisted Triceps Dip",
      "textDescription": "Mount shoulder width dip bar, arms straight with shoulders above hands. Kneel on padded platform, lowering it down slightly so hips are slightly bent. Lower body until slight stretch is felt in shoulders. Push body up until arms are straight. Repeat."
    },
    {
      "name": "Barbell Close Grip Bench Press",
      "textDescription": "Lie on bench and grasp barbell from rack with shoulder width grip. Lower weight to chest with elbows close to body. Push barbell back up until arms are straight. Repeat."
    },
    {
      "name": "Incline Barbell Close Grip Bench Press",
      "textDescription": "Lie on bench with bar above chest. Grasp bar from rack with shoulder width or slightly narrower grip. Disengage bar by rotating bar back. Lower weight to chest with elbows close to body. Push barbell up until arms are straight. Repeat."
    },
    {
      "name": "Barbell JM Press",
      "textDescription": "Lie on bench with back flat on bench and grasp barbell from rack with shoulder width or slightly narrower grip. Lower in straight line toward neck while keeping elbows relatively high and bending them out to sides, approximately 45° from midline of body. Flex wrists slightly as bar is lowered as to keep weight of bar on base of palms. Pause when forearms mak e solid contact with biceps. Push barbell back up until arms are straight. Repeat."
    },
    {
      "name": "Barbell Lying Tricpes Extension",
      "textDescription": "Lie on bench with narrow overhand grip on barbell. Position barbell over forehead with arms extended. Lower bar by bending elbows. As bar nears head, move elbows slightly back just enough to allow bar to clear around curvature of head. Extend arms. As bar clears head, reposition elbows to their former position until arms are fully extended. Repeat."
    },
    {
      "name": "Decline Barbell Lying Tricpes Extension",
      "textDescription": "Lie on decline bench with narrow overhand grip on barbell. Position barbell over shoulders with arms extended. Lower bar by bending elbows. As bar nears head, move elbows slightly back just enough to allow bar to clear around curvature of head. Extend arms. As bar clears head, reposition elbows to its former position until arms are fully extended. Repeat."
    },
    {
      "name": "Incline Barbell Lying Triceps Extension",
      "textDescription": "Lie on bench with narrow overhand grip on barbell. Position barbell over forehead with arms extended. Lower bar by bending elbows. As bar nears head, move elbows slightly back just enough to allow bar to clear around curvature of head. Extend arms. As bar clears head, reposition elbows to their former position until arms are fully extended. Repeat."
    },
    {
      "name": "Barbell Skull Crusher",
      "textDescription": "Lie on bench with narrow overhand grip on barbell. Position barbell over shoulders with arms extended. Lower bar to forehead by bending elbows. Extend arms and repeat."
    },
    {
      "name": "Barbell Triceps Extension",
      "textDescription": "Sit on utility weight bench with barbell. Position barbell overhead with narrow overhand grip. Lower barbell behind upper shoulders by flexing elbows allowing forearms to travel behind upper arms with elbows remaining overhead. Raise barbell overhead by extending elbows until arms are positioned straight and vertical. Lower and repeat."
    },
    {
      "name": "Reclined Barbell Triceps Extension",
      "textDescription": "Sit on incline bench angled at 70° to 80° with barbell. Position barbell overhead with narrow overhand grip. Lower barbell behind neck by flexing elbows allowing forearms to travel behind upper arms with elbows remaining overhead. Raise barbell overhead by extending elbows until arms are positioned straight and vertical. Lower and repeat."
    },
    {
      "name": "Cable Bent-over Triceps Extension",
      "textDescription": "Grasp cable bar from medium high pulley with narrow or shoulder width overhand grip. Turn body away from pulley apparatus and position turned cable bar behind neck. Bend over downward with cable bar positioned behind neck, gripped at each side. Lunge forward with one leg. Allow elbows to be pulled back under cable resistance. Extend forearms forward until elbows are straight. Allow cable bar to return back over neck. Repeat."
    },
    {
      "name": "Cable Bar Bent-over Triceps Extension",
      "textDescription": "Grasp cable bar from medium high pulley with narrow or shoulder width overhand grip. Turn body away from pulley apparatus and position turned cable bar behind neck. Bend over downward with cable bar positioned behind neck, gripped at each side. Lunge forward with one leg. Allow elbows to be pulled back under cable resistance. Extend forearms forward until elbows are straight. Allow cable bar to return back over neck. Repeat."
    },
    {
      "name": "Cable Forward Triceps Extension",
      "textDescription": "Grasp stirrup from medium high pulley. Turn body away from pulley apparatus and position stirrup over shoulder with palms down. Step forward with one foot so cable is taut. Position elbow forward about shoulder height. Push stirrup forward by extending forearm until elbow is straight. Allow stirrup to return back over shoulder. Repeat and repeat. Continue with opposite arm."
    },
    {
      "name": "Incline Cable Triceps Extension",
      "textDescription": "Grasp cable bar from behind with narrow overhand grip. Position elbows overhead. Extend forearm overhead until elbows are straight. Lower until forearms are against upper arms. Repeat."
    },
    {
      "name": "Kneeling Cable Triceps Extension",
      "textDescription": "Grasp cable bar from middle pulley with narrow or shoulder width overhand grip. Turn body away from pulley apparatus with cable bar above head. Kneel before bench, bend over and place elbows on edge of bench. Maintain upper arms parallel with shoulders as low as possible. Extend forearms over head until elbow are fully extended. Return and repeat."
    },
    {
      "name": "Cable Lying Triceps Extension",
      "textDescription": "Lie on bench and grasp bar with narrow overhand grip. With arms extended, position bar over face. Lower bar by bending elbow. As bar nears head, move elbows slightly back just enough to allow bar to clear around curvature of head. Extend arm. As bar clears head, reposition elbows to its former position until arm is fully extended. Repeat."
    },
    {
      "name": "Cable Bar Lying Triceps Extension",
      "textDescription": "Lie on bench and grasp cable bar with narrow overhand grip. With arms extended, position bar over face. Lower cable bar by bending elbow. As cable bar nears head, move elbows slightly back just enough to allow cable bar to clear around curvature of head. Extend arm. As cable bar clears head, reposition elbows to its former position until arm is fully extended. Repeat."
    },
    {
      "name": "Decline Cable Lying Triceps Extension",
      "textDescription": "Position legs under lower leg pad and lie back on bench. Grasp bar with narrow overhand grip. Position bar near forehead or top of head. Extend elbows to raise bar attachment until arms are straight. As arms extended, position them vertically. Lower bar by bending elbows. As bar nears head, reposition elbows back just enough to allow bar to clear around curvature of head. Repeat."
    },
    {
      "name": "Cable Pushdown",
      "textDescription": "Face high pulley and grasp cable attachment with narrow overhand grip. Position elbows to side. Extend arms down. Return until forearm is close to upper arm. Repeat."
    },
    {
      "name": "Alternating Cable Pushdown",
      "textDescription": "Sit on seat or bench in font of two close high pulleys. Grasp stirrup with each hand (over or underhand grip). Position elbows to side. Push one stirrup down by extending elbow until arm is straight. Return until forearm returns to original positon, keeping elbow close to side. Repeat with opposite arm and alternate."
    },
    {
      "name": "Seated Cable Pushdown",
      "textDescription": "Sit on seat or bench in font of two close high pulleys. Grasp stirrup with each hand (over or underhand grip). Position elbows to side. Push one stirrup down by extending elbow until arm is straight. Return until forearm returns to original positon, keeping elbow close to side. Repeat with opposite arm and alternate."
    },
    {
      "name": "Alternating Seated Cable Pushdown",
      "textDescription": "Sit on seat or bench in font of two close high pulleys. Grasp stirrup with each hand (over or underhand grip). Position elbows to side. Push one stirrup down by extending elbow until arm is straight. Return until forearm returns to original positon, keeping elbow close to side. Repeat with opposite arm and alternate."
    },
    {
      "name": "Cable Bar Pushdown",
      "textDescription": "Position adjustable pulleys slightly above head. Face cable bar and grasp with overhand narrow grip. Position elbows to side. Extend arms down. Return until forearm is close to upper arm. Repeat."
    },
    {
      "name": "Incline Cable Pushdown",
      "textDescription": "Lie on incline bench facing away from high pulley. Grasp cable attachment overhead with overhand narrow grip. Position elbow to sides, slightly up. Extend arms with elbows stationary. Return until forearm is close to upper arm. Repeat."
    },
    {
      "name": "Cable One Arm Pushdown",
      "textDescription": "Grasp dumbbell cable attachment with underhand grip. Position elbow to side. Extend arm down. Return until forearm is close to upper arm. Repeat. Continue with opposite arm."
    },
    {
      "name": "Cable Side Triceps Extension",
      "textDescription": "Grasp stirrup from medium high pulley. Turn body so pulley is to side of free arm while lifting stirrup over head. Step forward, just slightly to allow stirrup to be placed behind head, just over shoulder. Place elbow just slightly higher than shoulder height and position palm down. Push stirrup out to side by extending forearm until elbow is straight. Allow stirrup to return back over shoulder. Repeat and repeat. Continue with opposite arm."
    },
    {
      "name": "Cable Triceps Dip",
      "textDescription": "Step between shoulder width dip bars with dip belt around waist. Kneel as close to low pulley and attach cable to dip belt. Stand up and mount dip bar, arms straight with shoulders above hands. Keep hips straight. Lower body by bending arms until slight stretch is felt in shoulders. Push body up until arms are straight. Repeat."
    },
    {
      "name": "Cable Triceps Extension",
      "textDescription": "Grasp cable bar from medium high pulley with narrow or shoulder width overhand grip. Turn body away from pulley apparatus and position turned cable bar behind neck. Bend over downward with cable bar positioned behind neck, gripped at each side. Lunge forward with one leg. Allow elbows to be pulled back under cable resistance. Extend forearms forward until elbows are straight. Allow cable bar to return back over neck. Repeat."
    },
    {
      "name": "Cable One Arm Triceps Extension",
      "textDescription": "Grasp stirrup cable attachment from behind. Place hand with cable behind neck; palm toward neck and elbow positioned upward. Extend arm upward. Return and repeat. Continue with opposite arm."
    },
    {
      "name": "Dumbbell Kickback",
      "textDescription": "Kneel over bench with arm supporting body. Grasp dumbbell. Position upper arm parallel to floor. Extend arm until it is straight. Return and repeat. Continue with opposite arm."
    },
    {
      "name": "Dumbbell Lying Triceps Extension",
      "textDescription": "Lie on bench and position dumbbells over head with arms extended. Lower dumbbells by bending elbow until they are to sides of head. Extend arm. Repeat."
    },
    {
      "name": "Decline Dumbbell Lying Triceps Extension",
      "textDescription": "Lie on decline bench and position dumbbells over shoulders with arms extended. Lower dumbbells by bending elbow until they are to sides of head; dumbbells touch shoulder. Extend arm. Repeat."
    },
    {
      "name": "Incline Dumbbell Lying Triceps Extension",
      "textDescription": "Lie supine on incline bench with back of head on upper corner of bench. Position dumbbells over head with arms extended. Lower dumbbells by bending elbow until they are to sides of head. Extend arm and repeat."
    },
    {
      "name": "Dumbbell One Arm Triceps Extension",
      "textDescription": "Sit on seat with back support just below shoulder height. Position dumbbell overhead with arm straight up or slightly back. Lower dumbbell behind neck or shoulder while maintaining upper arm's vertical position throughout exercise. Extend arm until straight. Return and repeat. Continue with opposite arm."
    },
    {
      "name": "Reclined Dumbell One Arm Triceps Extension",
      "textDescription": "Lie on decline bench and position dumbbells over shoulders with arms extended. Lower dumbbells by bending elbow until they are to sides of head; dumbbells touch shoulder. Extend arm. Repeat."
    },
    {
      "name": "Dumbbell Triceps Extension",
      "textDescription": "Position one dumbbell over head with both hands under inner plate (heart shaped grip). With elbows over head, lower forearm behind upper arm by flexing elbows. Flex wrists at bottom to avoid hitting dumbbell on back of neck. Raise dumbbell over head by extending elbows while hyperextending wrists. Return and repeat."
    },
    {
      "name": "Reclined Dumbbell Triceps Extension",
      "textDescription": "Sit on incline bench angled at 70° to 80° with dumbbells in each hand. Position dumbbells over each shoulder with arms straight and vertical. Lower dumbbells behind each side of neck by flexing elbows allowing forearms to travel behind upper arms with elbows remaining overhead. Raise dumbbells overhead by extending elbows until arms are positioned straight and vertical. Lower and repeat."
    },
    {
      "name": "Machine Close Grip Bench Press",
      "textDescription": "Lie on bench with bar above chest and grasp bar with shoulder width or slightly narrower grip. Disengage bar by rotating bar back. Lower weight to chest with elbows close to body. Push bar back up until arms are straight. Repeat."
    },
    {
      "name": "Barbell Machine Close Grip Bench Press",
      "textDescription": "Lie on bench with bar above chest and grasp bar with shoulder width or slightly narrower grip. Disengage bar by rotating bar back. Lower weight to chest with elbows close to body. Push bar back up until arms are straight. Repeat."
    },
    {
      "name": "Machine Triceps Extension",
      "textDescription": "Sit on seat. Grasp handles and place back of upper arms parallel on padding with elbows approximately in line with lever's fulcrum. Push lever down until arms are fully extended. Return until forearms contact upper arms. Repeat."
    },
    {
      "name": "Machine Triceps Dip",
      "textDescription": "Mount shoulder width dip bar, arms straight with shoulders above hands. Kneel on padded platform, lowering it down slightly so hips are slightly bent. Lower body until slight stretch is felt in shoulders. Push body up until arms are straight. Repeat."
    },
    {
      "name": "Incline Machine Triceps Extension",
      "textDescription": "Lie supine on incline bench with back of head on upper corner of bench. Position dumbbells over head with arms extended. Lower dumbbells by bending elbow until they are to sides of head. Extend arm and repeat."
    },
    {
      "name": "Machine Overhead Triceps Extension",
      "textDescription": "Position one dumbbell over head with both hands under inner plate (heart shaped grip). With elbows over head, lower forearm behind upper arm by flexing elbows. Flex wrists at bottom to avoid hitting dumbbell on back of neck. Raise dumbbell over head by extending elbows while hyperextending wrists. Return and repeat."
    },
    {
      "name": "Machine Pushdown",
      "textDescription": "Sit on seat and grasp handles by shoulders. Position elbows to sides. Push lever down beyond hips until arm is fully extended. Return and repeat."
    },
    {
      "name": "Seated Machine Close Grip Press",
      "textDescription": "Sit on seat with upper chest just above grips on lever. If available, push foot lever until handles are within grasping range. Grasp handles with wide oblique overhand grip and position elbows out to sides. Release foot lever. Press lever until arms are extended. Return weight until shoulders or chest feels slightly stretched. Repeat."
    },
    {
      "name": "Standing Sled Machine Triceps Dip",
      "textDescription": "Stand between handles facing machine. Grasp parallel handles and position elbows back. Squat down slightly by bending hips and knees, just enough to raise selected weight up from remaining weight stack. Push levers down by straightening arms downward. Allow lever bar to raise with elbows pointing back until slight stretch is felt in shoulders. Repeat."
    },
    {
      "name": "Smith Machine Close Grip Bench Press",
      "textDescription": "Lie on bench with bar above chest and grasp bar with shoulder width or slightly narrower grip. Disengage bar by rotating bar back. Lower weight to chest with elbows close to body. Push bar back up until arms are straight. Repeat."
    },
    {
      "name": "Incline Smith Machine Close Grip Bench Press",
      "textDescription": "Lie on incline bench with bar above chest and grasp bar with shoulder width or slightly narrower grip. Disengage bar by rotating bar back. Lower weight to chest with elbows close to body. Push bar back up until arms are straight. Repeat."
    },
    {
      "name": "Weighted Bench Dip",
      "textDescription": "Sit on inside of one of two benches placed parallel, slightly less than leg's length away. Place hands on edge of bench. Straighten arms, slide rear end off of edge of bench and position heels on adjacent bench with legs straight. Have assistant place weight on lap near hips. Lower body by bending arms until slight stretch is felt in chest or shoulder, or rear end touches floor. Raise body and repeat."
    },
    {
      "name": "Weighted Close Grip Push-up",
      "textDescription": "Lie prone on floor with hands under shoulders or slightly narrower. Position body up off floor with extended arms and body straight. Partner can place weight plate(s) on back if needed. Keeping body straight, lower body to floor by bending arms. Push body up until arms are extended. Repeat."
    },
    {
      "name": "Weighted Triceps Dip",
      "textDescription": "Place weight on dip belt around waist or place dumbbell between lower legs just above feet. Mount shoulder width dip bar, arms straight with shoulders above hands. Keep hips straight. Lower body until slight stretch is felt in shoulders. Push body up until arms are straight. Repeat."
    },
    {
      "name": "Barbell Curl",
      "textDescription": "Grasp bar with shoulder width underhand grip. With elbows to side, raise bar until forearms are vertical. Lower until arms are fully extended. Repeat."
    },
    {
      "name": "Barbell Drag Curl",
      "textDescription": "Grasp bar with shoulder width underhand grip. Raise barbell straight up so elbows travel back as elbows flex. Follow contour of hips and waist. As elbows continues to flex, begin bringing elbows forward when forearms rises past horizontal position. Continue upward over chest until forearms are perpendicular. Lower until arms are fully extended. Repeat."
    },
    {
      "name": "Alternating Cable Curl",
      "textDescription": "Stand between or facing double low pulleys. Grasp stirrups to each side, palms facing forward. Pull one stirrup up forward and upward toward shoulder while keeping elbow stationary. Return until arm is fully extended. Repeat on other arm, alternating between sides."
    },
    {
      "name": "Seated Alternating Cable Curl",
      "textDescription": "Sit on seat situated between two low pulleys down to each side. Grasp stirrups in each hand, palms facing forward. Pull one stirrup up toward shoulder while keeping elbow stationary. Return until arm is fully extended. Repeat with other arm, alternating between sides."
    },
    {
      "name": "Cable Curl",
      "textDescription": "Stand behind preacher bench. Grasp cable bar with shoulder width underhand grip. Position back of arms on pad. Raise cable bar toward shoulders. Lower cable bar until arms are fully extended. Repeat."
    },
    {
      "name": "Cable Bar Curl",
      "textDescription": "Grasp low cable bar with shoulder width underhand grip. Stand close to cable bar. With elbows to side, raise bar until forearms are vertical. Lower until arms are fully extended. Repeat."
    },
    {
      "name": "EZ-bar curl",
      "textDescription": "Grasp bar with shoulder width underhand grip. With elbows to side, raise bar until forearms are vertical. Lower until arms are fully extended. Repeat."
    },
    {
      "name": "Cable One Arm Curl",
      "textDescription": "Face low pulley and grasp stirrup cable attachment to one side with underhand grip. With elbow to side, raise bar until forearms are vertical. Lower until arms are fully extended. Repeat. Continue with opposite arm."
    },
    {
      "name": "Dumbbell Curl",
      "textDescription": "Position two dumbbells to sides, palms facing in, arms straight. With elbows to sides, raise one dumbbell and rotate forearm until forearm is vertical and palm faces shoulder. Lower to original position and repeat with opposite arm. Continue to alternate between sides."
    },
    {
      "name": "Seated Dumbbell Curl",
      "textDescription": "Sit back on 45-60 degree incline bench. With arms hanging down straight, position two dumbbells with palms facing inward. With elbows back to sides, raise one dumbbell and rotate forearm until forearm is vertical and palm faces shoulder. Lower to original position and repeat with opposite arm. Continue to alternate between sides."
    },
    {
      "name": "Incline Dumbbell Curl",
      "textDescription": "Sit back on 45-60 degree incline bench. With arms hanging down straight, position two dumbbells with palms facing inward. With elbows back to sides, raise one dumbbell and rotate forearm until forearm is vertical and palm faces shoulder. Lower to original position and repeat with opposite arm. Continue to alternate between sides."
    },
    {
      "name": "Machine Curl",
      "textDescription": "Sit on curl machine placing back of arms on pad. Grasp lever handles with underhand grip. Align elbows at same pivot point as fulcrum of lever. Raise lever handles toward shoulders. Lower handles until arms are fully extended. Repeat."
    },
    {
      "name": "Alternating Machine Curl",
      "textDescription": "Sit on seat and grasp handles with underhand grip. Raise lever on handle until elbow is fully flexed with back of upper arm remaining on pad. Lower handle until arm is fully extended. Repeat with opposite arm. Continue to alternate movement between sides."
    },
    {
      "name": "Band-assisted Triceps Dip",
      "textDescription": "Place one foot on middle of exercise band with ends looped on shoulder width dip bars. Push band down partially by extending leg. Mount dip bar with arms straight and shoulders above hands. Place other foot on exercise band next to other foot. Keep hips straight. Lower body until slight stretch is felt in shoulders. Push body up until arms are straight. Repeat."
    },
    {
      "name": "Bench Dip",
      "textDescription": "Sit on inside of one of two benches placed parallel, slightly less than leg's length away. Place hands on edge of bench. Straighten arms, slide rear end off of edge of bench and position heels on adjacent bench with legs straight. Have assistant place weight on lap near hips. Lower body by bending arms until slight stretch is felt in chest or shoulder, or rear end touches floor. Raise body and repeat."
    },
    {
      "name": "Close Grip Push-up",
      "textDescription": "Lie prone on floor with hands under shoulders or slightly narrower. Position body up off floor with extended arms and body straight. Keeping body straight, lower body to floor by bending arms. Push body up until arms are extended. Repeat."
    },
    {
      "name": "Decline Close Grip Push-up",
      "textDescription": "Kneel on floor with bench or elevation behind body. Position hands on floor with hands under shoulders or slightly narrower. Place feet on bench or elevation. Raise body in plank position with body straight and arms extended. Keeping body straight, lower upper body to floor by bending arms. To allow for full descent, pull head back slightly without arching back. Push body up until arms are extended. Repeat."
    },
    {
      "name": "Incline Close Grip Push-up",
      "textDescription": "Grasp horizontal bar (lower than chest height) with hands shoulder width or slightly narrower. Position forefeet back from bar with arms and body straight. Arms should be perpendicular to body. Keeping body straight, lower chest to bar by bending arms. Push body up until arms are extended. Repeat."
    },
    {
      "name": "Suspended Triceps Extension",
      "textDescription": "Grasp handles and step forward between suspension trainers. Position arms downward and slightly forward, nearly parallel with suspension straps. Lean forward, placing upper body weight onto handles with arms straight, while stepping back onto forefeet so body is leaning forward at desired angle. Straighten body, so torso is in-line with legs. Lower body by bending elbows, allowing head to travel between suspension handles. Raise body up and back up until arms are extended. Repeat."
    },
    {
      "name": "Triceps dip between benches",
      "textDescription": "Stand between ends of two benches. Place hands on ends of benches with fingers off end of benches. Grip should be somewhat narrow. Position feet out in front with legs straight, heels on floor, and torso upright. Lower body by bending arms, allowing elbows to point back. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat."
    },
    {
      "name": "Triceps Dip between benches",
      "textDescription": "Stand between ends of two benches. Place hands on ends of benches with fingers off end of benches. Grip should be somewhat narrow. Position feet out in front with legs straight, heels on floor, and torso upright. Lower body by bending arms, allowing elbows to point back. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat."
    },
    {
      "name": "Suspended Triceps Dip",
      "textDescription": "Stand between two suspension handles and grasp handles on each side of torso. Hold position firmly and lift feet from floor. Push body up until arms are straight. Lower body until slight stretch is felt in shoulders. Repeat."
    },
    { "name": "Overhead Stretch", "textDescription": "Preparation Execution" },
    {
      "name": "Towel Stretch",
      "textDescription": "Sit on mat or floor with knees bent. Position towel under middle of foot with hands grasping towel on both ends. Lie back and raise leg straight above maintaining grip on towel with both hands. Pull leg back while keeping knee straight. Hold stretch. Repeat with opposite leg."
    },
    {
      "name": "Barbell Reverse Curl",
      "textDescription": "Grasp bar with shoulder width overhand grip. With elbows to side, raise bar until forearms are vertical. Lower until arms are fully extended. Repeat."
    },
    {
      "name": "Barbell Reverse Preacher Curl",
      "textDescription": "Sit on preacher bench placing back of arms on pad. Grasp curl bar with shoulder width overhand grip. Raise bar until forearms are vertical. Lower barbell until arm is fully extended. Repeat."
    },
    {
      "name": "Standing Barbell Reverse Preacher Curl",
      "textDescription": "Place back of arms on pad with one foot forward. Grasp curl bar with shoulder width underhand grip. Raise bar until forearms are vertical. Lower barbell until arm is fully extended. Repeat."
    },
    {
      "name": "Cable Hammer Curl",
      "textDescription": "Grasp cable rope with palms facing inward. Stand upright with arms straight down to sides. With elbows to side, raise rope forward and upward with both arms until forearms are vertical. Lower until arms are fully extended. Repeat."
    },
    {
      "name": "Cable Reverse Curl",
      "textDescription": "Grasp cable bar with shoulder width overhand grip. With elbows to side, raise bar until forearms are vertical. Lower until arms are fully extended. Repeat."
    },
    {
      "name": "Cable Bar Reverse Curl",
      "textDescription": "Grasp cable bar with shoulder width overhand grip. Stand close to cable bar. With elbows to side, raise bar until forearms are vertical. Lower until arms are fully extended. Repeat."
    },
    {
      "name": "Cable Reverse Preacher Curl",
      "textDescription": "Sit on preacher bench placing back of arms on pad. Grasp cable bar with shoulder width overhand grip. Raise cable bar toward shoulders. Lower cable bar until arm is fully extended. Repeat."
    },
    {
      "name": "Standing Cable Reverse Preacher Curl",
      "textDescription": "Stand behind preacher bench. Grasp cable bar with shoulder width overhand grip. Position back of arms on pad. Raise cable bar toward shoulders. Lower cable bar until arm is fully extended. Repeat."
    },
    {
      "name": "Dumbbell Hammer Curl",
      "textDescription": "Position two dumbbells to sides, palms facing in, arms straight. With elbows to sides, raise one dumbbell until forearm is vertical and thumb faces shoulder. Lower to original position and repeat with alternative arm."
    },
    {
      "name": "Machine Hammer Preacher Curl",
      "textDescription": "Sit on curl machine placing back of arms on pad. Grasp lever handles and position grips with thumb side up. Align elbows at near same pivot point as fulcrum of lever. Raise lever handles toward shoulders, maintaining palms in grip. Lower handles until arm is fully extended. Repeat."
    },
    {
      "name": "Machine Reverse Curl",
      "textDescription": "Place lower legs between pads with feet on bar. Lay torso and waist on bench and grasp handles. Raise lever back and up by flexing knees. Lower lever until knees are straight. Repeat."
    },
    {
      "name": "Machine Reverse Preacher Curl",
      "textDescription": "Sit on curl machine placing back of arms on pad. Grasp lever handles with overhand grip. Align elbows at near same pivot point as fulcrum of lever. Raise lever handles toward shoulders. Lower handles until arm is fully extended. Repeat."
    },
    {
      "name": "Barbell Wrist Curl",
      "textDescription": "Sit and grasp bar with narrow to shoulder width underhand grip. Rest forearms on thighs with wrists just beyond knees. Allow barbell to roll out of palms down to fingers. Raise barbell back up by gripping and pointing knuckles up as high as possible. Lower and repeat."
    },
    {
      "name": "Cable Wrist Curl",
      "textDescription": "Sit and grasp cable bar with narrow to shoulder width underhand grip. Rest forearms on thighs with wrists just beyond knees. Allow cable bar to roll out of palms down to fingers. Raise cable bar back up by gripping and pointing knuckles up as high as possible. Lower and repeat."
    },
    {
      "name": "Cable One Arm Wrist Curl",
      "textDescription": "Sit and grasp cable stirrup. Rest forearm on thigh with palm up and wrist just beyond knees. Allow cable bar to roll out of palms down to fingers. Raise cable bar back up by gripping and pointing knuckles up as high as possible. Lower and repeat."
    },
    {
      "name": "Dumbbell Wrist Curl",
      "textDescription": "Sit and grasp dumbbell with underhand grip. Rest forearm on thigh with wrist just beyond knee. Allow dumbbell to roll out of palm down to fingers. Raise dumbbell back up by gripping and pointing knuckles up as high as possible. Lower and repeat."
    },
    {
      "name": "Machine Wrist Curl",
      "textDescription": "Sit on curl machine placing back of arms on pad. Grasp lever handles with underhand grip. Align elbows at same pivot point as fulcrum of lever. Raise lever handles toward shoulders. Lower handles until arms are fully extended. Repeat."
    },
    {
      "name": "Machine Grip",
      "textDescription": "Step up and grasp parallel grips. Kneel on padded platform and lower body down with arm extended. Pull body up until elbows are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Machine Wrist Roller",
      "textDescription": "Stand behind weight plate(s) on floor and grasp wrist roller handle with both hands; over hand grip. With left hand gripping handle, relax grip of right hand and slide grip behind handle (by hypexending wrist) and regrip. Relax grip of left hand and flex right wrist. Repeat sequence with opposite hands, alternating back and forth until weight plate has raised up near hands. Lower weight steadily with opposite movement."
    },
    {
      "name": "Sled Machine One Hand Grip",
      "textDescription": "Bend over and grasp bar grips with one hand; fingers under lower bar and base of thumb over top stationary bar. Squeeze bar grips together until lower bar makes contact with upper bar. Release to original position and repeat."
    },
    {
      "name": "Sled Machine Grip",
      "textDescription": "Stand between handles facing machine. Bend forward slightly and grasp transverse handles with overhand grip. Position elbows upward and outward. Bend knees just enough to raise selected weight up from remaining weight stack. Push lever down by straightening arms. Return lever up with elbows flaring out until chest is slightly stretched. Repeat."
    },
    {
      "name": "Barbell Reverse Wrist Curl",
      "textDescription": "Sit and grasp bar with narrow to shoulder width overhand grip. Rest forearms on thighs with wrists just beyond knees. Raise barbell by pointing knuckles upward as high as possible. Return until knuckles are pointing downward as far as possible. Repeat."
    },
    {
      "name": "Cable Reverse Wrist Curl",
      "textDescription": "Sit and grasp cable bar with narrow to shoulder width overhand grip. Rest forearms on thighs with wrists just beyond knees. Raise stirrup by pointing knuckles upward as high as possible. Return until knuckles are pointing downward as far as possible. Repeat."
    },
    {
      "name": "Cable One Arm Reverse Wrist Curl",
      "textDescription": "Sit and grasp cable stirrup. Rest forearm on thigh with palm facing down and with wrist just beyond knee. Raise stirrup by pointing knuckles upward as high as possible. Return until knuckles are pointing downward as far as possible. Repeat."
    },
    {
      "name": "Cable Wrist Roller",
      "textDescription": "Stand behind weight plate(s) on floor and grasp wrist roller handle with both hands; over hand grip. With left hand gripping handle, relax grip of right hand and slide grip behind handle (by hypexending wrist) and regrip. Relax grip of left hand and flex right wrist. Repeat sequence with opposite hands, alternating back and forth until weight plate has raised up near hands. Lower weight steadily with opposite movement."
    },
    {
      "name": "Dumbbell Reverse Wrist Curl",
      "textDescription": "Sit and grip dumbbell with overhand grip. Rest forearm on thigh with wrist just beyond knee. Raise dummbell by pointing knuckles upward as high as possible. Return until knuckles are pointing downward as far as possible. Repeat."
    },
    {
      "name": "Machine Reverse Wrist Curl",
      "textDescription": "Sit on curl machine placing back of arms on pad. Grasp lever handles with overhand grip. Align elbows at near same pivot point as fulcrum of lever. Raise lever handles toward shoulders. Lower handles until arm is fully extended. Repeat."
    },
    {
      "name": "Dumbbell Lying Pronation",
      "textDescription": "Grasp unilaterally loaded dumbbell with thumb next to weighted side. Lie on bench on side with weight and position arm with \"half dumbbell\" on bench. Bend elbow approximately 90-degrees and tucked bent elbow under body. Position thumb down (supinated). Rotate dumbbell so thumb turns upward (pronation). Return and repeat."
    },
    {
      "name": "Seated Dumbbell Pronation",
      "textDescription": "Sit next to elevated surface, approximately arm pit height. With hand of upper arm, grasp unilaterally loaded dumbbell; pinkie positioned near weighted side. Bend elbow approximately 90-degrees and place upperarm on elevated surface. Position thumb upward (supinated). Rotate dumbbell so thumb turns downward (pronation). Return and repeat."
    },
    {
      "name": "Seated Machine Pronation",
      "textDescription": "Sit on seat. Grasp rotating handles with underhand grip on each side and place forearms on pads. Rotate shafts by turning palm downward. Return and repeat."
    },
    {
      "name": "Standing Machine Pronation",
      "textDescription": "Grasp open handle at end of shaft with underhand grip. Rotate shaft by turning palm downward. Return and repeat."
    },
    {
      "name": "Dumbbell Lying Supination",
      "textDescription": "Lie on bench or mat. With hand of upper arm, grasp unilaterally loaded dumbbell; thumb next to side with weight. Bend elbow approximately 90-degrees and place forearm on hip, or side of waist. Position thumb downward (pronated). Rotate dumbbell so thumb turns upward (supination). Return and repeat."
    },
    {
      "name": "Seated Dumbbell Supination",
      "textDescription": "Sit next to elevated surface, approximately arm pit height. With hand of arm next to elevated surface, grasp unilaterally loaded dumbbell; thumb next to side with weight. Bend elbow approximately 90-degrees and place upperarm on elevated surface. Position thumb downward (pronated). Rotate dumbbell so thumb turns upward (supination). Return and repeat."
    },
    {
      "name": "Seated Machine Supination",
      "textDescription": "Sit on seat. Grasp rotating handles with overhand grip on each side and place forearms on pads. Rotate shafts by turning palm upward. Return and repeat."
    },
    {
      "name": "Standing Machine Supination",
      "textDescription": "Grasp open handle at end of shaft with overhand grip. Rotate shaft by turning palm upward. Return and repeat."
    },
    {
      "name": "Standing Stretch",
      "textDescription": "Stand and touch wall or stationary object for balance. Grasp top ankle or forefoot behind. Pull ankle or forefoot to rear end and straighten hip by moving knee backward. Hold stretch. Repeat with opposite side."
    },
    {
      "name": "Praying Stretch",
      "textDescription": "Place palms together in front of body. Point fingers toward neck. Pushing hands together, lower away from body until wrists separate. Hold stretch. Repeat with opposite arm."
    },
    {
      "name": "Seated Stretch",
      "textDescription": "Sit on floor or mat with soles of feet together on floor and close to body. Grasp feet with both hands and position elbows on inside of lower legs. Press knees toward floor with elbows. Hold stretch."
    },
    {
      "name": "Single Arm Stretch",
      "textDescription": "With palm facing downward, grasp underside of fingers with other hand and straighten elbow. Pull finger and wrist upward and back toward forearm. Hold stretch. Repeat with opposite arm."
    },
    {
      "name": "Kneeling Stretch",
      "textDescription": "Lunge forward with knee on padded mat. Position foot beyond forward knee. Place hands on knee. Straighten hip of rear leg by pushing hips forward. Hold stretch. Repeat with opposite side."
    },
    {
      "name": "Barbell Bent-over Row",
      "textDescription": "Bend knees slightly and bend over bar with back straight. Grasp bar with wide overhand grip. Pull bar to upper waist. Return until arms are extended and shoulders are stretched downward. Repeat."
    },
    {
      "name": "Barbell Cambered Bar Lying Row",
      "textDescription": "Lie chest down on elevated bench. Grasp cambered barbell below with overhand grip. Pull bar to upper waist or lower chest. Return until arms are extended and shoulders are stretched downward. Repeat."
    },
    {
      "name": "Incline Cable Row",
      "textDescription": "Sit on incline and place feet on lower bar, or foot platform. Slide hips down by bending knees. Bend over and grasp cable attachment. Slide hips back, positioning knees with slight bend. Pull cable attachment to waist while straightening back upright. Pull shoulders back and push chest forward while arching back. Return until arms are extended, shoulders are stretched forward, and lower back is flexed forward. Repeat."
    },
    {
      "name": "Cable Kneeling Row",
      "textDescription": "Place right knee on lower pad (positioned to right side) with foot of other leg slightly back out to side and knee slightly bent. Place right forearm on right side of upper pad and grasp handle. Grasp cable stirrup below with left hand. Allow left shoulder to be pulled forward without spinal rotation. Pull stirrup up to side until elbow travels beyond surface of back. Return until arm is extended and shoulder is stretched downward. Repeat and continue with opposite side."
    },
    {
      "name": "Cable Lying Row",
      "textDescription": "Straddle head of bench and grasp stirrups on two high pulley cables. Lie on bench with stirrups in each hand and arms extended upward. Pull stirrups down to each side of chest until elbows are behind back and shoulders are pulled back. Return until arms are extended and shoulders are stretched upward. Repeat."
    },
    {
      "name": "Cable One Arm Bent-over Row",
      "textDescription": "Grasp cable stirrup. Step back away from pulley, with foot on same side as exercising arm, positioned out to side well behind forward foot. Bend over with hand on nearby bar or above knee for support. Keep back straight and knees slightly bent. Allow shoulder with stirrup to be pulled forward. Pull cable attachment to side of torso, pulling shoulder back. Return until arm is extended and shoulder is stretched forward. Repeat. Continue with opposite arm."
    },
    {
      "name": "Seated Cable One Arm ROw",
      "textDescription": "Sit slightly forward on platform or secured bench in order to grasp cable stirrup with one hand. Position hips back with knees slightly bent . Allow shoulder with stirrup to be pulled forward. Pull cable attachment to side of torso, slightly twisting through waist. Pull shoulder back and push chest forward during contraction. Return until arm is extended and shoulder is stretched forward. Repeat. Continue with opposite arm."
    },
    {
      "name": "Seated Cable One Arm Row",
      "textDescription": "Sit slightly forward on platform or secured bench in order to grasp cable stirrup with one hand. Position hips back with knees slightly bent . Allow shoulder with stirrup to be pulled forward. Pull cable attachment to side of torso, slightly twisting through waist. Pull shoulder back and push chest forward during contraction. Return until arm is extended and shoulder is stretched forward. Repeat. Continue with opposite arm."
    },
    {
      "name": "Seated Cable One Arm High Row",
      "textDescription": "Sit slightly forward on platform or secured bench close to cable attachment. Bend forward and grasp cable stirrup with one hand. Slide hips back by positioning knees with slight bend. Allow arm, shoulder, and torso to be pulled forward under weight on cable. Pull cable attachment to side of torso, straightening back and leaning back slightly. Pull shoulder back and push chest forward during contraction. Return until arm is extended and torso is pulled forward. Repeat. Continue with opposite arm."
    },
    {
      "name": "Cable Seated High Row",
      "textDescription": "Sit slightly forward on bench or platform in order to grasp cable attachment. Place feet on vertical platform. Slide hips back positioning knees with slight bend. Allow weight on cable to pull torso forward while stretching arms and shoulders upward. Pull cable attachment to waist and lean back slightly. Pull shoulders back and push chest forward while arching back. Return until torso, arms, and shoulders pulled forward. Repeat."
    },
    {
      "name": "Cable Seated Row",
      "textDescription": "Sit slightly forward on seat or bench in order to grasp cable attachment. Place feet on vertical platform. Slide hips back positioning knees with slight bend. Pull cable attachment to waist while straightening lower back. Pull shoulders back and push chest forward while arching back. Return until arms are extended, shoulders are stretched forward, and lower back is flexed forward. Repeat."
    },
    {
      "name": "Standing Cable One Arm Row",
      "textDescription": "Stand to side of medium height, rotating pulley. Place hand shoulder height or slightly lower on support bar with arm straight. Place foot nearest supporting arm forward with knee slightly bent and opposite foot back. Grasp cable stirrup with one hand, allowing shoulder to be pulled forward under weight on cable. Pull cable attachment to side of torso while pulling shoulder back, arching spine, and pushing chest forward. Return until arm is extended and shoulder is pulled forward. Repeat. Continue with opposite arm."
    },
    {
      "name": "Handstand Push-up on parallettes",
      "textDescription": "Stand facing parallette bars. Squat down and grasp bars with elbows bent and tucked. Bend forward, position head low, and kick feet up with legs bent so torso is in forward angled inverted position. While maintaining balance extend legs over body with spine hyperextended. While maintaining body balanced over bars, push inverted body up by extending arms until straight. Lower body down by bending arms until shoulders are close to bars. Repeat."
    },
    {
      "name": "Dumbbell Bent-over Row",
      "textDescription": "Kneel over side of bench by placing knee and hand of supporting arm on bench. Position foot of opposite leg slightly back to side. Grasp dumbbell from floor. Pull dumbbell to up to side until it makes contact with ribs or until upper arm is just beyond horizontal. Return until arm is extended and shoulder is stretched downward. Repeat and continue with opposite arm."
    },
    {
      "name": "Dumbbell Lying Row",
      "textDescription": "Lie chest down on elevated bench. Grasp dumbbells below. Pull dumbbells to sides until upper arm is just beyond horizontal or height of back. Return until arms are extended and shoulders are stretched downward. Repeat."
    },
    {
      "name": "Machine Bent-over Row",
      "textDescription": "Bend knees slightly and bend over bar with back straight. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Pull bar to upper waist. Return until arms are extended and shoulders are stretched downward. Repeat."
    },
    {
      "name": "Barbell Machine Bent-over Row",
      "textDescription": "Bend knees slightly and bend over bar with back straight. Grasp bar with wide overhand grip. Pull bar to upper waist. Return until arms are extended and shoulders are stretched downward. Repeat."
    },
    {
      "name": "Machine One Arm Bent-over Row",
      "textDescription": "Grasp cable stirrup. Step back away from pulley, with foot on same side as exercising arm, positioned out to side well behind forward foot. Bend over with hand on nearby bar or above knee for support. Keep back straight and knees slightly bent. Allow shoulder with stirrup to be pulled forward. Pull cable attachment to side of torso, pulling shoulder back. Return until arm is extended and shoulder is stretched forward. Repeat. Continue with opposite arm."
    },
    {
      "name": "Incline Machine Row",
      "textDescription": "Lie chest on inclined platform and grasp lever handles with overhand grip. Pull lever up as high as possible. Return until arms are extended and shoulders are stretched downward. Repeat."
    },
    {
      "name": "Standing Machine One Arm Row",
      "textDescription": "Stand between two shoulder-high cable pulleys (adjustable cross-over machine). Grasp right stirrup with left hand and left stirrup with right hand. Step back until cables are angled back 30° to 45°. Position both elbows at height of shoulders, one over other. Pull both cable attachments by moving elbows back to sides. Keep upper arms horizontal, perpendicular to trunk. Return and repeat."
    },
    {
      "name": "Seated Machine Alternating Row",
      "textDescription": "Sit and grasp cable stirrups one with each hand. Lean back slightly allowing arms, shoulders, and torso to be pulled forward under weight on cables. Pull one cable stirrup to side. Pull shoulder back, push chest forward, and rotate body slightly toward pulling arm. Return until arm is extended and torso faces forward. Pull with opposite arm alternating between each side. Repeat."
    },
    {
      "name": "Seated Machine Row",
      "textDescription": "Sit on seat and position chest against pad. Push foot lever if available. Grasp narrower parallel grip handles. Pull lever back until elbows are behind back and shoulders are pulled back. Return until arms are extended and shoulders are stretched forward. Repeat."
    },
    {
      "name": "Machine T-bar Row",
      "textDescription": "Bend knees slightly and bend over lever handles with back straight. Grasp lever handles with shoulder width to wide overhand grip. Pull lever up to torso. Return until arms are extended and shoulders are stretched downward. Repeat."
    },
    {
      "name": "Smith Machine Bent-over Row",
      "textDescription": "Bend knees slightly and bend over bar with back straight. Grasp bar with wide overhand grip. Disengage bar by rotating bar back. Pull bar to upper waist. Return until arms are extended and shoulders are stretched downward. Repeat."
    },
    {
      "name": "Weighted Inverted Row",
      "textDescription": "Lay on back under fixed horizontal bar. Grasp bar with wide overhand grip. Place back of heels on elevated surface. Keeping body straight, pull body up to bar. Return until arms are extended and shoulders are stretched forward. Repeat."
    },
    {
      "name": "Machine Chin-up",
      "textDescription": "Step up and grasp bar with underhand shoulder width grip. Kneel onto platform or step onto bar. Pull body up until elbows are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Machine Parallel Close Grip Pull-up",
      "textDescription": "Step up and grasp parallel grips. Kneel on padded platform and lower body down with arm extended. Pull body up until elbows are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Machine Pull-up",
      "textDescription": "Step up and grasp parallel grips. Kneel on padded platform and lower body down with arm extended. Pull body up until elbows are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Barbell Pullover",
      "textDescription": "Lie upper back perpendicular on bench. Flex hips slightly. Grasp barbell from behind and position over chest with elbows bent slightly. With elbows bent slightly, lower bar over and beyond head until shoulders are fully flexed or upper arms are approximately parallel to torso. Return and repeat."
    },
    {
      "name": "Cable Close Grip Pulldown",
      "textDescription": "Grasp parallel cable attachment. Sit with thighs under supports. Pull down cable attachment to upper chest. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Alternating Cable Close Grip Pulldown",
      "textDescription": "Grasp stirrups in each hand. Sit with thighs under supports. Pull down one cable attachment to side of chest. Return until arm and shoulder is fully extended. Repeat with opposite arm, alternating between sides."
    },
    {
      "name": "Cable One Arm Close Grip Pulldown",
      "textDescription": "Grasp stirrups in each hand. Sit with thighs under supports. Pull down one cable attachment to side of chest. Return until arm and shoulder is fully extended. Repeat with opposite arm, alternating between sides."
    },
    {
      "name": "Kneeling Cable One Arm Close Grip Pulldown",
      "textDescription": "Grasp cable bar with wide grip. Sit with thighs under supports. Pull down cable bar to upper chest. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Kneeling Bent-over Pulldown",
      "textDescription": "Kneel on mat slightly away from high pulley. Grasp cable rope attachment with both hands. Sit with hips back and bend down by flexing hips so torso is bent over at approximately 30º angle. Allow resistance on cable pulley to pull arms upward with elbows bent. Pull cable rope down until elbows are back and inside of rope attachment is behind neck. Return attachment over head until shoulder is completely flexed upward. Repeat."
    },
    {
      "name": "Kneeling Cable Bent-over Pulldown",
      "textDescription": "Kneel on mat slightly away from high pulley. Grasp cable rope attachment with both hands. Sit with hips back and bend down by flexing hips so torso is bent over at approximately 30º angle. Allow resistance on cable pulley to pull arms upward with elbows bent. Pull cable rope down until elbows are back and inside of rope attachment is behind neck. Return attachment over head until shoulder is completely flexed upward. Repeat."
    },
    {
      "name": "Cable Pulldown",
      "textDescription": "Grasp cable bar with wide grip. Sit with thighs under supports. Pull down cable bar to upper chest. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Alternating Cable Pulldown",
      "textDescription": "Grasp stirrups in each hand. Sit with thighs under supports. Pull down one cable attachment to front side shoulder. Return until arm and shoulder are fully extended. Repeat with opposite arm, alternating between sides."
    },
    {
      "name": "Cable Pullover",
      "textDescription": "Face high pulley and grasp revolving cable attachment with arm slightly bent. Place one foot slightly back and bend over at hip until shoulder is fully flexed (upper arms at sides of head). With elbows fixed approximately 30°, pull cable attachment down until upper arms are to sides. Return attachment overhead. Repeat."
    },
    {
      "name": "Cable Chinup",
      "textDescription": "Place dip belt around waist. Kneel close to low pulley or lever and attach hook to dip belt chains. Step up and grasp bars with shoulder width underhand grip. Lift legs off of steps or floor. Pull body up until elbow are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Cable Parallel Close Grip Pull-up",
      "textDescription": "Place dip belt around waist. Kneel as close as possible to low pulley or lever and attach hook to dip belt in front between legs. Step up and grasp close grip p arallel bars with hands facing inward. Lift legs off of steps or floor. Pull body up until elbow are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Cable Parallel Grip Pull-up",
      "textDescription": "Place dip belt around waist. Kneel as close as possible to low pulley or lever and attach hook to dip belt in front between legs. Step up and grasp parallel bars with hands facing inward. Lift legs off of steps or floor. Pull body up until elbow are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Cable Pull-up",
      "textDescription": "Place dip belt around waist. Kneel close to low pulley or lever and attach hook to dip belt. Step up and grasp bars with overhand wide grip. Lift legs off of steps or floor. Pull body up until chin is above bar. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Cable Rear Pull-up",
      "textDescription": "Place dip belt around waist. Kneel close to low pulley or lever and attach hook to dip belt. Step up and grasp bars with overhand wide grip. Lift legs off of steps or floor. Pull body up until bar touches back of neck. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Cable Rear Pulldown",
      "textDescription": "Grasp cable bar with wide grip. Sit with thighs under supports. Pull cable bar down behind neck. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Standing Cable Pulldown",
      "textDescription": "Grasp cable bar with wide grip. Sit with thighs under supports. Pull down cable bar to upper chest. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Alternating Standing Cable Pulldown",
      "textDescription": "Grasp stirrups in each hand. Lean forward and step back with one foot so stance is staggered. Bend forward knee slightly. Position hands with underhand or neutral grip. Pull down left cable attachment to front of shoulder. Pull right cable attachment down to front of other shoulder while returning left cable attachment to front of shoulder. Repeat movement with both arms in opposite pattern by pulling left cable attachment while returning right pully attachment. Continuing by alternating movement pattern between sides."
    },
    {
      "name": "Machine Close Grip Pulldown",
      "textDescription": "Grasp parallel cable attachment. Sit with thighs under supports. Pull down cable attachment to upper chest. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Machine Front Pulldown",
      "textDescription": "Grasp lever handles. Sit with thighs under supports. Pull down lever to upper chest. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Machine Pulldown",
      "textDescription": "Grasp cable bar with wide grip. Sit with thighs under supports. Pull down cable bar to upper chest. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Machine Pullover",
      "textDescription": "Adjust seat height so lever is near shoulder axis. Sit on machine and push foot lever. Place elbows on pads and grasp bar from behind. Release foot lever and place feet on platform or to sides. Pull lever forward and down until elbows are to sides. Return until shoulders are fully flexed, or upper arms are parallel to torso. Repeat."
    },
    {
      "name": "Machine Rear Pulldown",
      "textDescription": "Grasp cable bar with wide grip. Sit with thighs under supports. Pull cable bar down behind neck. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Machine Underhand Pulldown",
      "textDescription": "Grasp lever handles with underhand grip. Sit with thighs under supports. Pull down lever handles to upper chest until elbows are to sides. Return until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Machine Iron Cross",
      "textDescription": "Stand on platform and grasp handles to sides with palms down grip. With arms straight, pull lever handles down below hips. Return lever handles upward just above shoulder high, or just before slight pressure in shoulder is felt. Repeat."
    },
    {
      "name": "Weighted Chin-up",
      "textDescription": "Step up and grasp bar with underhand shoulder width grip. Pull body up until elbows are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Weighted Parallel Close Grip Pull-up",
      "textDescription": "Step up and grasp close grip parallel bars. Pull body up until elbow are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Weighted Pull-up",
      "textDescription": "Step up and grasp bar with overhand wide grip. Pull body up until chin is above bar. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Weighted Rear Pull-up",
      "textDescription": "Step up and grasp bar with overhand wide grip. Pull body up until bar touches back of neck. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Inverted Row",
      "textDescription": "Lay on back under fixed horizontal bar. Grasp bar with wide overhand grip. Keeping body straight, pull body up to bar. Return until arms are extended and shoulders are stretched forward. Repeat."
    },
    {
      "name": "Underhand Inverted Row",
      "textDescription": "Lay on back under fixed horizontal bar. Grasp bar with shoulder width underhand grip. Keeping body straight, pull body up to bar. Return until arms are extended and shoulders are stretched forward. Repeat."
    },
    {
      "name": "Suspended Inverted Row",
      "textDescription": "Position suspension handles higher than arms' length above floor. Sit on floor and grasp handles. Position body supine hanging from handles with arms straight, shoulders under handles, body straight, and back of heels on floor. Pull body up so sides of chest make contact with handles while keeping body straight. Return until arms are extended straight and shoulders are stretched forward. Repeat."
    },
    {
      "name": "Suspended Power Pull",
      "textDescription": "Grasp suspension handle(s) with one hand. Step back until handle is chest height when held to side of chest. Facing suspension apparatus with feet shoulder width apart, point other arm and its shoulder forward, parallel with angle of strap. Rotate body and extended arm, reaching outward while lowering body downward by extending arm holding onto handle. Extend arms and shoulders in-line with suspension strap so body is angled back to one side. Return by raising body back upward in opposite motion, reaching outward and toward suspension strap while pulling handle back to side of chest until body is upright and arm parallel with angle of strap. Repeat and continue with opposite side."
    },
    {
      "name": "Suspended Row",
      "textDescription": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handles. Position body and legs straight at desired angle, hanging from handles with arms straight. Pull body up so sides of chest make contact with handles while keeping body and legs straight. Return until arms are extended straight and shoulders are stretched forward. Repeat."
    },
    {
      "name": "Fixed Bar Stretch",
      "textDescription": "Stand facing stationary bar. Grasp stationary bar with one hand approximately waist height. Bend over allowing hips to fall back. Slightly lean torso toward stretched arm. Hold stretch. Repeat with opposite side."
    },
    {
      "name": "Lever Stretch",
      "textDescription": "Flip seat all way back. Stand facing bar with supporting foot slightly forward under, or near apparatus. Grasp handle bars for support. Place top of other foot back on top edge of shin pad. Squat down with back straight while straightening hip of rear leg by pushing hips forward. Hold stretch. Repeat with opposite side."
    },
    {
      "name": "Band-assisted Chin-up",
      "textDescription": "Grab each side of hanging exercise band with both hands. Stretch exercise band down and step onto bottom inside of band with one foot. Stretch band down further by extending leg straight down. Reach up and grasp bar with underhand shoulder width grip while keeping banded leg straight. Pull body up until elbows are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Band-assisted Pull--up",
      "textDescription": "Grab each side of hanging exercise band with both hands. Stretch exercise band down and step onto bottom inside of band with one foot. Stretch band down further by extending leg straight down. Reach up and grasp bar with overhand wide grip while keeping banded leg straight. Pull body up until chin is above bar. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Band-assisted Rear Pull-up",
      "textDescription": "Grasp middle of hanging exercise band and pull down to side of leg. Lift foot and hook band under heel. Stretch band down further by extending leg straight down. Face perpendicular under pullup bar and position band behind body. Pull band apart and place other foot onto band so both feet are together inside of band. Reach up and grasp pull-up bar with overhand wide grip while keeping legs straight. Pull body up until bar touches back of neck. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Band-assisted Pull-up",
      "textDescription": "Grab each side of hanging exercise band with both hands. Stretch exercise band down and step onto bottom inside of band with one foot. Stretch band down further by extending leg straight down. Reach up and grasp bar with overhand wide grip while keeping banded leg straight. Pull body up until chin is above bar. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Chin-up",
      "textDescription": "Step up and grasp bar with underhand shoulder width grip. Pull body up until elbows are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Pull-up",
      "textDescription": "Step up and grasp bar with overhand wide grip. Pull body up until chin is above bar. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Parallel Close Grip Pull-up",
      "textDescription": "Step up and grasp parallel bars. Pull body up until elbow are to sides. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Rear Pull-up",
      "textDescription": "Step up and grasp bar with overhand wide grip. Pull body up until bar touches back of neck. Lower body until arms and shoulders are fully extended. Repeat."
    },
    {
      "name": "Inverted Shrug",
      "textDescription": "Stand between parallel bars. Squat down and grasp parallel bars from above. Kick legs up inverting and balancing body upside down. Legs can be kept bent or straight, positioned vertically. Raise body up a high as possible by pulling shoulders toward ears. Lower body to original position and repeat."
    },
    {
      "name": "Suspended Inverted Shrug",
      "textDescription": "Grasp gymnastics rings, one in each hand. Sit on mat between parallel bars. Kick legs up inverting and balancing body upside down. Raise body up a high as possible by pulling shoulders toward ears. Lower body to original position and repeat."
    },
    {
      "name": "Upper Trapezious Stretch",
      "textDescription": "Grasp wrist or hand from behind and pull arm to opposite side. Tilt head away from lowered shoulder by positioning ear toward front of opposite shoulder. Hold stretch. Repeat to other side."
    },
    {
      "name": "Chair Trapezius Stretch",
      "textDescription": "Sit on chair slightly angled to right. Position legs far apart with feet on floor. Bend over slightly to grasp back of front right chair leg with left hand. Pull up on chair leg by position torso more upright while allowing left shoulder to be pulled downward. Hold stretch. Repeat on opposite side while sitting slightly angled to left."
    },
    {
      "name": "Broomstick Stretch",
      "textDescription": "Grasp end of pole with one hand. Flip pole over upper arm. Position bent arm to side of body with other end of pole behind arm. Reach across body as far as possible with opposite arm and grasp lower end of pole. Position elbow at height of shoulder with pole positioned on back side of upper arm.  Pull lower end of pole forward and upward so shoulder is externally rotated. Hold stretch. Repeat with opposite arm."
    },
    {
      "name": "Bent-over Stretch",
      "textDescription": "Place both hands on waist with thumbs facing forward. Bend over so torso is parallel to floor. Allow elbows to fall downward toward floor. Hold stretch ."
    },
    {
      "name": "Seated Bent-over Stretch",
      "textDescription": "Sit on bench or chair. Place both hands on waist with thumbs facing forward. Lean over and rest torso on thighs. Allow elbows to fall downward toward floor. Hold stretch."
    },
    {
      "name": "Side Lying Stretch",
      "textDescription": "Lie down on side on mat or floor. Position arm on floor with bent elbow positioned forward on mat and hand above elbow. With other hand, grasp back of wrist. Keeping elbow bend at a right angle, push forearm downward toward floor. Hold stretch. Repeat on opposite side."
    },
    {
      "name": "Side Lying Teres Minor Stretch",
      "textDescription": "Lie down on side on mat or floor. Position arm on floor with bent elbow positioned forward on mat and hand above elbow. With other hand, grasp back of wrist. Keeping elbow bend at a right angle, push forearm downward toward floor. Hold stretch. Repeat on opposite side."
    },
    {
      "name": "Supine Infraspinatus Stretch",
      "textDescription": "Lie supine on mat or floor with legs bent and feet on floor. Bend elbows 90º and position to side of shoulders with back of upper arm on floor. Keeping elbows bend at a right angles, push forearms downward toward floor and hold stretch."
    },
    {
      "name": "Prone InfraSpinatus Stretch",
      "textDescription": "Lie prone on mat or floor. Extend arms out to each side on floor.  Bend elbows 90º and position back of hands to sides of body. Lower bend arms toward floor and hold stretch."
    },
    {
      "name": "Suspended Shoulder External Rotation",
      "textDescription": "Grasp suspension handles and position bent elbows to each sides of waist. Execution"
    },
    {
      "name": "Seated Barbell Cambered Bar Shrug",
      "textDescription": "Sit on end of bench and grasp cambered bar from beneath with overhand or mixed grip. Elevate shoulders as high as possible. Lower and repeat."
    },
    {
      "name": "Barbell Shrug",
      "textDescription": "Stand holding barbell with overhand or mixed grip; shoulder width or slightly wider. Elevate shoulders as high as possible. Lower and repeat."
    },
    {
      "name": "Trap Bar Shrug",
      "textDescription": "Step into trap barbell and stand holding handles of trap bar to sides. Elevate shoulders as high as possible. Lower and repeat."
    },
    {
      "name": "Cable Shrug",
      "textDescription": "Stand facing low pulley and grasp cable bar with shoulder width or slightly wider overhand grip. Stand close to pulley. With arms straight, elevate shoulders as high as possible. Lower and repeat."
    },
    {
      "name": "Cable Bar Shrug",
      "textDescription": "Position adjustable pulleys at low position. Stand close to cable bar and grasp with shoulder width or slightly wider overhand grip. Elevate shoulders as high as possible. Lower and repeat."
    },
    {
      "name": "Cable Dual Pulley Shrug",
      "textDescription": "Stand between two low pulleys and grasp stirrups to each side. Stand upright with arms straight down to each side. With arms straight, elevate shoulders as high as possible. Lower and repeat."
    },
    {
      "name": "Dumbbell Shrug",
      "textDescription": "Stand holding dumbbells to sides. Elevate shoulders as high as possible. Lower and repeat."
    }
  ]
}
